*** crates/twerk-core/src/domain_types.rs:230:13: replace < with == in parse_go_duration

*** mutation diff:
--- crates/twerk-core/src/domain_types.rs
+++ replace < with == in parse_go_duration
@@ -222,17 +222,17 @@
     if s.is_empty() {
         return Err(GoDurationError::Empty);
     }
 
     let mut total = Duration::ZERO;
     let bytes = s.as_bytes();
     let mut i = 0;
 
-    while i < bytes.len() {
+    while i == /* ~ changed by cargo-mutants ~ */ bytes.len() {
         // Read the numeric part.
         let start = i;
         while i < bytes.len() && (bytes[i].is_ascii_digit() || bytes[i] == b'.') {
             i += 1;
         }
         if i == start {
             // No digits found.
             return Err(GoDurationError::ParseNumber(start));

---- domain_types::tests::go_duration_combo stdout ----

thread 'domain_types::tests::go_duration_combo' (1656089) panicked at crates/twerk-core/src/domain_types.rs:489:9:
assertion `left == right` failed
  left: 0ns
 right: 5400s

---- domain_types::tests::go_duration_days stdout ----

thread 'domain_types::tests::go_duration_days' (1656091) panicked at crates/twerk-core/src/domain_types.rs:495:9:
assertion `left == right` failed
  left: 0ns
 right: 172800s

---- domain_types::tests::go_duration_complex stdout ----

thread 'domain_types::tests::go_duration_complex' (1656090) panicked at crates/twerk-core/src/domain_types.rs:521:9:
assertion `left == right` failed
  left: 0ns
 right: 217815.5s

failures:
    domain_types::tests::go_duration_combo
    domain_types::tests::go_duration_complex
    domain_types::tests::go_duration_days
    domain_types::tests::go_duration_micros
    domain_types::tests::go_duration_millis
    domain_types::tests::go_duration_nanos
    domain_types::tests::go_duration_seconds
    trigger::data::tests::polling_trigger_new_returns_ok_when_all_fields_valid
    trigger::data::tests::trigger_polling_roundtrip_serialization
    trigger::data_tests::additional_coverage_tests::pollingtrigger_deserialization_minimal
    trigger::data_tests::additional_coverage_tests::pollingtrigger_deserialization_with_all_fields
    trigger::data_tests::additional_coverage_tests::pollingtrigger_new_accepts_large_timeout

test result: FAILED. 567 passed; 42 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.65s

*** result: Failure(101)
