*** crates/twerk-core/src/redact.rs:159:5: replace redact_task_mounts -> crate::task::Task with Default::default()

*** mutation diff:
--- crates/twerk-core/src/redact.rs
+++ replace redact_task_mounts -> crate::task::Task with Default::default()
@@ -151,26 +151,17 @@
     crate::task::Task { env, ..task }
 }
 
 /// Redact mount options on a task.
 fn redact_task_mounts(
     task: crate::task::Task,
     secrets: &HashMap<String, String>,
 ) -> crate::task::Task {
-    let mounts = task.mounts.as_ref().map(|mounts| {
-        mounts
-            .iter()
-            .map(|m| crate::mount::Mount {
-                opts: m.opts.as_ref().map(|o| redact_vars(o, secrets)),
-                ..m.clone()
-            })
-            .collect()
-    });
-    crate::task::Task { mounts, ..task }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Redact registry password on a task.
 fn redact_task_registry(task: crate::task::Task) -> crate::task::Task {
     let registry = task.registry.as_ref().map(|r| crate::task::Registry {
         password: r.password.as_ref().map(|_| REDACTED_STR.to_string()),
         ..r.clone()
     });

---- redact::tests::tests::test_redact_task_env stdout ----

thread 'redact::tests::tests::test_redact_task_env' (629092) panicked at crates/twerk-core/src/redact/tests.rs:124:35:
called `Option::unwrap()` on a `None` value

---- redact::tests::tests::test_redact_task_registry_password stdout ----

thread 'redact::tests::tests::test_redact_task_registry_password' (629096) panicked at crates/twerk-core/src/redact/tests.rs:145:18:
called `Option::unwrap()` on a `None` value

failures:
    redact::tests::tests::test_redact_task_env
    redact::tests::tests::test_redact_task_registry_password

test result: FAILED. 607 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
