*** crates/twerk-core/src/redact.rs:163:17: delete field opts from struct crate::mount::Mount expression in redact_task_mounts

*** mutation diff:
--- crates/twerk-core/src/redact.rs
+++ delete field opts from struct crate::mount::Mount expression in redact_task_mounts
@@ -155,17 +155,17 @@
 fn redact_task_mounts(
     task: crate::task::Task,
     secrets: &HashMap<String, String>,
 ) -> crate::task::Task {
     let mounts = task.mounts.as_ref().map(|mounts| {
         mounts
             .iter()
             .map(|m| crate::mount::Mount {
-                opts: m.opts.as_ref().map(|o| redact_vars(o, secrets)),
+                 /* ~ changed by cargo-mutants ~ */
                 ..m.clone()
             })
             .collect()
     });
     crate::task::Task { mounts, ..task }
 }
 
 /// Redact registry password on a task.

---- rq2_serde_ts_pascal_case_accepted stdout ----

thread 'rq2_serde_ts_pascal_case_accepted' (635102) panicked at crates/twerk-core/tests/red_queen_gen2.rs:352:9:
serde must accept PascalCase "Active"

---- rq2_ts_serde_case_variants_rejected stdout ----

thread 'rq2_ts_serde_case_variants_rejected' (635126) panicked at crates/twerk-core/tests/red_queen_gen2.rs:75:9:
serde must accept "Active"

failures:
    rq2_serde_ts_pascal_case_accepted
    rq2_ts_serde_case_variants_rejected

test result: FAILED. 65 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
