*** crates/twerk-core/src/redact.rs:173:5: replace redact_task_registry -> crate::task::Task with Default::default()

*** mutation diff:
--- crates/twerk-core/src/redact.rs
+++ replace redact_task_registry -> crate::task::Task with Default::default()
@@ -165,21 +165,17 @@
             })
             .collect()
     });
     crate::task::Task { mounts, ..task }
 }
 
 /// Redact registry password on a task.
 fn redact_task_registry(task: crate::task::Task) -> crate::task::Task {
-    let registry = task.registry.as_ref().map(|r| crate::task::Registry {
-        password: r.password.as_ref().map(|_| REDACTED_STR.to_string()),
-        ..r.clone()
-    });
-    crate::task::Task { registry, ..task }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Redact subjob secrets and webhook headers on a task.
 fn redact_task_subjob(
     task: crate::task::Task,
     secrets: &HashMap<String, String>,
 ) -> crate::task::Task {
     let subjob = task.subjob.as_ref().map(|sj| {

---- redact::tests::tests::test_redact_task_env stdout ----

thread 'redact::tests::tests::test_redact_task_env' (640533) panicked at crates/twerk-core/src/redact/tests.rs:124:35:
called `Option::unwrap()` on a `None` value

---- redact::tests::tests::test_redact_task_registry_password stdout ----

thread 'redact::tests::tests::test_redact_task_registry_password' (640535) panicked at crates/twerk-core/src/redact/tests.rs:145:18:
called `Option::unwrap()` on a `None` value

failures:
    redact::tests::tests::test_redact_task_env
    redact::tests::tests::test_redact_task_registry_password

test result: FAILED. 607 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
