*** crates/twerk-core/src/domain_types.rs:230:13: replace < with <= in parse_go_duration

*** mutation diff:
--- crates/twerk-core/src/domain_types.rs
+++ replace < with <= in parse_go_duration
@@ -222,17 +222,17 @@
     if s.is_empty() {
         return Err(GoDurationError::Empty);
     }
 
     let mut total = Duration::ZERO;
     let bytes = s.as_bytes();
     let mut i = 0;
 
-    while i < bytes.len() {
+    while i <= /* ~ changed by cargo-mutants ~ */ bytes.len() {
         // Read the numeric part.
         let start = i;
         while i < bytes.len() && (bytes[i].is_ascii_digit() || bytes[i] == b'.') {
             i += 1;
         }
         if i == start {
             // No digits found.
             return Err(GoDurationError::ParseNumber(start));

---- domain_types::tests::go_duration_millis stdout ----

thread 'domain_types::tests::go_duration_millis' (1677083) panicked at crates/twerk-core/src/domain_types.rs:500:42:
called `Result::unwrap()` on an `Err` value: ParseNumber(5)

---- domain_types::tests::go_duration_micros stdout ----

thread 'domain_types::tests::go_duration_micros' (1677082) panicked at crates/twerk-core/src/domain_types.rs:506:42:
called `Result::unwrap()` on an `Err` value: ParseNumber(5)

---- domain_types::tests::go_duration_days stdout ----

thread 'domain_types::tests::go_duration_days' (1677079) panicked at crates/twerk-core/src/domain_types.rs:494:39:
called `Result::unwrap()` on an `Err` value: ParseNumber(2)

failures:
    domain_types::tests::go_duration_combo
    domain_types::tests::go_duration_complex
    domain_types::tests::go_duration_days
    domain_types::tests::go_duration_from_str_roundtrip
    domain_types::tests::go_duration_micros
    domain_types::tests::go_duration_millis
    domain_types::tests::go_duration_nanos
    domain_types::tests::go_duration_seconds
    trigger::data::tests::polling_trigger_new_returns_ok_when_all_fields_valid
    trigger::data::tests::trigger_polling_roundtrip_serialization
    trigger::data_tests::additional_coverage_tests::pollingtrigger_deserialization_minimal
    trigger::data_tests::additional_coverage_tests::pollingtrigger_deserialization_with_all_fields

test result: FAILED. 557 passed; 52 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.67s

*** result: Failure(101)
