*** crates/twerk-core/src/domain_types.rs:233:17: replace < with <= in parse_go_duration

*** mutation diff:
--- crates/twerk-core/src/domain_types.rs
+++ replace < with <= in parse_go_duration
@@ -225,17 +225,17 @@
 
     let mut total = Duration::ZERO;
     let bytes = s.as_bytes();
     let mut i = 0;
 
     while i < bytes.len() {
         // Read the numeric part.
         let start = i;
-        while i < bytes.len() && (bytes[i].is_ascii_digit() || bytes[i] == b'.') {
+        while i <= /* ~ changed by cargo-mutants ~ */ bytes.len() && (bytes[i].is_ascii_digit() || bytes[i] == b'.') {
             i += 1;
         }
         if i == start {
             // No digits found.
             return Err(GoDurationError::ParseNumber(start));
         }
         let num_str = &s[start..i];
         let is_float = num_str.contains('.');

---- rq2_serde_ts_pascal_case_accepted stdout ----

thread 'rq2_serde_ts_pascal_case_accepted' (1713149) panicked at crates/twerk-core/tests/red_queen_gen2.rs:352:9:
serde must accept PascalCase "Active"

---- rq2_ts_serde_case_variants_rejected stdout ----

thread 'rq2_ts_serde_case_variants_rejected' (1713173) panicked at crates/twerk-core/tests/red_queen_gen2.rs:75:9:
serde must accept "Active"

failures:
    rq2_serde_ts_pascal_case_accepted
    rq2_ts_serde_case_variants_rejected

test result: FAILED. 65 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
