*** crates/twerk-core/src/domain_types.rs:233:31: replace && with || in parse_go_duration

*** mutation diff:
--- crates/twerk-core/src/domain_types.rs
+++ replace && with || in parse_go_duration
@@ -225,17 +225,17 @@
 
     let mut total = Duration::ZERO;
     let bytes = s.as_bytes();
     let mut i = 0;
 
     while i < bytes.len() {
         // Read the numeric part.
         let start = i;
-        while i < bytes.len() && (bytes[i].is_ascii_digit() || bytes[i] == b'.') {
+        while i < bytes.len() || /* ~ changed by cargo-mutants ~ */ (bytes[i].is_ascii_digit() || bytes[i] == b'.') {
             i += 1;
         }
         if i == start {
             // No digits found.
             return Err(GoDurationError::ParseNumber(start));
         }
         let num_str = &s[start..i];
         let is_float = num_str.contains('.');

---- domain_types::tests::go_duration_millis stdout ----

thread 'domain_types::tests::go_duration_millis' (1683230) panicked at crates/twerk-core/src/domain_types.rs:233:70:
index out of bounds: the len is 5 but the index is 5

---- domain_types::tests::go_duration_from_str_roundtrip stdout ----

thread 'domain_types::tests::go_duration_from_str_roundtrip' (1683228) panicked at crates/twerk-core/src/domain_types.rs:233:70:
index out of bounds: the len is 5 but the index is 5

---- domain_types::tests::go_duration_combo stdout ----

thread 'domain_types::tests::go_duration_combo' (1683224) panicked at crates/twerk-core/src/domain_types.rs:233:70:
index out of bounds: the len is 5 but the index is 5

failures:
    domain_types::tests::go_duration_combo
    domain_types::tests::go_duration_complex
    domain_types::tests::go_duration_days
    domain_types::tests::go_duration_from_str_roundtrip
    domain_types::tests::go_duration_micros
    domain_types::tests::go_duration_millis
    domain_types::tests::go_duration_nanos
    domain_types::tests::go_duration_seconds
    trigger::data::tests::polling_trigger_new_returns_invalid_interval_when_interval_is_zero
    trigger::data::tests::polling_trigger_new_returns_ok_when_all_fields_valid
    trigger::data::tests::trigger_polling_roundtrip_serialization
    trigger::data_tests::additional_coverage_tests::pollingtrigger_deserialization_minimal

test result: FAILED. 552 passed; 57 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.99s

*** result: Failure(101)
