*** crates/twerk-core/src/redact.rs:177:25: delete field registry from struct crate::task::Task expression in redact_task_registry

*** mutation diff:
--- crates/twerk-core/src/redact.rs
+++ delete field registry from struct crate::task::Task expression in redact_task_registry
@@ -169,17 +169,17 @@
 }
 
 /// Redact registry password on a task.
 fn redact_task_registry(task: crate::task::Task) -> crate::task::Task {
     let registry = task.registry.as_ref().map(|r| crate::task::Registry {
         password: r.password.as_ref().map(|_| REDACTED_STR.to_string()),
         ..r.clone()
     });
-    crate::task::Task { registry, ..task }
+    crate::task::Task {  /* ~ changed by cargo-mutants ~ */ ..task }
 }
 
 /// Redact subjob secrets and webhook headers on a task.
 fn redact_task_subjob(
     task: crate::task::Task,
     secrets: &HashMap<String, String>,
 ) -> crate::task::Task {
     let subjob = task.subjob.as_ref().map(|sj| {

---- redact::tests::tests::test_redact_task_registry_password stdout ----

thread 'redact::tests::tests::test_redact_task_registry_password' (651530) panicked at crates/twerk-core/src/redact/tests.rs:141:9:
assertion `left == right` failed
  left: "registry_secret"
 right: "[REDACTED]"

failures:
    redact::tests::tests::test_redact_task_registry_password

test result: FAILED. 608 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
