*** crates/twerk-core/src/redact.rs:185:5: replace redact_task_subjob -> crate::task::Task with Default::default()

*** mutation diff:
--- crates/twerk-core/src/redact.rs
+++ replace redact_task_subjob -> crate::task::Task with Default::default()
@@ -177,37 +177,17 @@
     crate::task::Task { registry, ..task }
 }
 
 /// Redact subjob secrets and webhook headers on a task.
 fn redact_task_subjob(
     task: crate::task::Task,
     secrets: &HashMap<String, String>,
 ) -> crate::task::Task {
-    let subjob = task.subjob.as_ref().map(|sj| {
-        let secrets_map = sj.secrets.as_ref().map(|s| {
-            s.keys()
-                .map(|k| (k.clone(), REDACTED_STR.to_string()))
-                .collect()
-        });
-        let webhooks = sj.webhooks.as_ref().map(|whs| {
-            whs.iter()
-                .map(|w| crate::webhook::Webhook {
-                    headers: w.headers.as_ref().map(|h| redact_vars(h, secrets)),
-                    ..w.clone()
-                })
-                .collect()
-        });
-        crate::task::SubJobTask {
-            secrets: secrets_map,
-            webhooks,
-            ..sj.clone()
-        }
-    });
-    crate::task::Task { subjob, ..task }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Recursively redact a vector of tasks.
 fn redact_nested_tasks(
     tasks: Option<Vec<crate::task::Task>>,
     secrets: &HashMap<String, String>,
 ) -> Option<Vec<crate::task::Task>> {
     tasks.map(|ts| ts.into_iter().map(|t| redact_task(t, secrets)).collect())

---- redact::tests::tests::test_redact_task_env stdout ----

thread 'redact::tests::tests::test_redact_task_env' (657948) panicked at crates/twerk-core/src/redact/tests.rs:124:35:
called `Option::unwrap()` on a `None` value

---- redact::tests::tests::test_redact_task_registry_password stdout ----

thread 'redact::tests::tests::test_redact_task_registry_password' (657950) panicked at crates/twerk-core/src/redact/tests.rs:145:18:
called `Option::unwrap()` on a `None` value

failures:
    redact::tests::tests::test_redact_task_env
    redact::tests::tests::test_redact_task_registry_password

test result: FAILED. 607 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.85s

*** result: Failure(101)
