*** crates/twerk-core/src/redact.rs:205:25: delete field subjob from struct crate::task::Task expression in redact_task_subjob

*** mutation diff:
--- crates/twerk-core/src/redact.rs
+++ delete field subjob from struct crate::task::Task expression in redact_task_subjob
@@ -197,17 +197,17 @@
                 .collect()
         });
         crate::task::SubJobTask {
             secrets: secrets_map,
             webhooks,
             ..sj.clone()
         }
     });
-    crate::task::Task { subjob, ..task }
+    crate::task::Task {  /* ~ changed by cargo-mutants ~ */ ..task }
 }
 
 /// Recursively redact a vector of tasks.
 fn redact_nested_tasks(
     tasks: Option<Vec<crate::task::Task>>,
     secrets: &HashMap<String, String>,
 ) -> Option<Vec<crate::task::Task>> {
     tasks.map(|ts| ts.into_iter().map(|t| redact_task(t, secrets)).collect())

---- rq2_serde_ts_pascal_case_accepted stdout ----

thread 'rq2_serde_ts_pascal_case_accepted' (677564) panicked at crates/twerk-core/tests/red_queen_gen2.rs:352:9:
serde must accept PascalCase "Active"

---- rq2_ts_serde_case_variants_rejected stdout ----

thread 'rq2_ts_serde_case_variants_rejected' (677588) panicked at crates/twerk-core/tests/red_queen_gen2.rs:75:9:
serde must accept "Active"

failures:
    rq2_serde_ts_pascal_case_accepted
    rq2_ts_serde_case_variants_rejected

test result: FAILED. 65 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
