*** crates/twerk-core/src/domain_types.rs:244:14: replace >= with < in parse_go_duration

*** mutation diff:
--- crates/twerk-core/src/domain_types.rs
+++ replace >= with < in parse_go_duration
@@ -236,17 +236,17 @@
         if i == start {
             // No digits found.
             return Err(GoDurationError::ParseNumber(start));
         }
         let num_str = &s[start..i];
         let is_float = num_str.contains('.');
 
         // Determine the unit.
-        if i >= bytes.len() {
+        if i < /* ~ changed by cargo-mutants ~ */ bytes.len() {
             return Err(GoDurationError::NoUnit(start));
         }
 
         let (unit_len, multiplier): (usize, u128) = if s[i..].starts_with("ns") {
             (2, 1)
         } else if s[i..].starts_with("us") {
             (2, 1_000)
         } else if s[i..].starts_with("\u{00b5}s") {

---- domain_types::tests::go_duration_combo stdout ----

thread 'domain_types::tests::go_duration_combo' (2006457) panicked at crates/twerk-core/src/domain_types.rs:488:42:
called `Result::unwrap()` on an `Err` value: NoUnit(0)

---- domain_types::tests::go_duration_days stdout ----

thread 'domain_types::tests::go_duration_days' (2006459) panicked at crates/twerk-core/src/domain_types.rs:494:39:
called `Result::unwrap()` on an `Err` value: NoUnit(0)

---- domain_types::tests::go_duration_from_str_roundtrip stdout ----

thread 'domain_types::tests::go_duration_from_str_roundtrip' (2006461) panicked at crates/twerk-core/src/domain_types.rs:531:45:
called `Result::unwrap()` on an `Err` value: NoUnit(0)

failures:
    domain_types::tests::go_duration_combo
    domain_types::tests::go_duration_complex
    domain_types::tests::go_duration_days
    domain_types::tests::go_duration_from_str_roundtrip
    domain_types::tests::go_duration_micros
    domain_types::tests::go_duration_millis
    domain_types::tests::go_duration_nanos
    domain_types::tests::go_duration_seconds
    trigger::data::tests::polling_trigger_new_returns_ok_when_all_fields_valid
    trigger::data::tests::trigger_polling_roundtrip_serialization
    trigger::data_tests::additional_coverage_tests::pollingtrigger_deserialization_minimal
    trigger::data_tests::additional_coverage_tests::pollingtrigger_deserialization_with_all_fields

test result: FAILED. 557 passed; 52 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.77s

*** result: Failure(101)
