*** crates/twerk-core/src/redact.rs:213:5: replace redact_nested_tasks -> Option<Vec<crate::task::Task>> with Some(vec![])

*** mutation diff:
--- crates/twerk-core/src/redact.rs
+++ replace redact_nested_tasks -> Option<Vec<crate::task::Task>> with Some(vec![])
@@ -205,17 +205,17 @@
     crate::task::Task { subjob, ..task }
 }
 
 /// Recursively redact a vector of tasks.
 fn redact_nested_tasks(
     tasks: Option<Vec<crate::task::Task>>,
     secrets: &HashMap<String, String>,
 ) -> Option<Vec<crate::task::Task>> {
-    tasks.map(|ts| ts.into_iter().map(|t| redact_task(t, secrets)).collect())
+    Some(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Redact parallel tasks on a task.
 fn redact_task_parallel(
     task: crate::task::Task,
     secrets: &HashMap<String, String>,
 ) -> crate::task::Task {
     let parallel = task.parallel.as_ref().map(|p| crate::task::ParallelTask {

---- rq2_serde_ts_pascal_case_accepted stdout ----

thread 'rq2_serde_ts_pascal_case_accepted' (693984) panicked at crates/twerk-core/tests/red_queen_gen2.rs:352:9:
serde must accept PascalCase "Active"

---- rq2_ts_serde_case_variants_rejected stdout ----

thread 'rq2_ts_serde_case_variants_rejected' (694008) panicked at crates/twerk-core/tests/red_queen_gen2.rs:75:9:
serde must accept "Active"

failures:
    rq2_serde_ts_pascal_case_accepted
    rq2_ts_serde_case_variants_rejected

test result: FAILED. 65 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
