*** crates/twerk-core/src/domain_types.rs:279:31: replace * with / in parse_go_duration

*** mutation diff:
--- crates/twerk-core/src/domain_types.rs
+++ replace * with / in parse_go_duration
@@ -271,17 +271,17 @@
                 .parse()
                 .map_err(|_| GoDurationError::ParseNumber(start))?;
             // Safe: multiplier fits in f64 without precision loss for reasonable durations
             #[allow(
                 clippy::cast_possible_truncation,
                 clippy::cast_sign_loss,
                 clippy::cast_precision_loss
             )]
-            let result = (val * multiplier as f64) as u128;
+            let result = (val / /* ~ changed by cargo-mutants ~ */ multiplier as f64) as u128;
             result
         } else {
             let val: u64 = num_str
                 .parse()
                 .map_err(|_| GoDurationError::ParseNumber(start))?;
             u128::from(val) * multiplier
         };

---- rq2_serde_ts_pascal_case_accepted stdout ----

thread 'rq2_serde_ts_pascal_case_accepted' (2028572) panicked at crates/twerk-core/tests/red_queen_gen2.rs:352:9:
serde must accept PascalCase "Active"

---- rq2_ts_serde_case_variants_rejected stdout ----

thread 'rq2_ts_serde_case_variants_rejected' (2028596) panicked at crates/twerk-core/tests/red_queen_gen2.rs:75:9:
serde must accept "Active"

failures:
    rq2_serde_ts_pascal_case_accepted
    rq2_ts_serde_case_variants_rejected

test result: FAILED. 65 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
