*** crates/twerk-core/src/redact.rs:221:5: replace redact_task_parallel -> crate::task::Task with Default::default()

*** mutation diff:
--- crates/twerk-core/src/redact.rs
+++ replace redact_task_parallel -> crate::task::Task with Default::default()
@@ -213,21 +213,17 @@
     tasks.map(|ts| ts.into_iter().map(|t| redact_task(t, secrets)).collect())
 }
 
 /// Redact parallel tasks on a task.
 fn redact_task_parallel(
     task: crate::task::Task,
     secrets: &HashMap<String, String>,
 ) -> crate::task::Task {
-    let parallel = task.parallel.as_ref().map(|p| crate::task::ParallelTask {
-        tasks: redact_nested_tasks(p.tasks.clone(), secrets),
-        ..p.clone()
-    });
-    crate::task::Task { parallel, ..task }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Redact pre, post, and sidecar nested tasks.
 fn redact_task_pre_post_sidecars(
     task: crate::task::Task,
     secrets: &HashMap<String, String>,
 ) -> crate::task::Task {
     let pre = redact_nested_tasks(task.pre.clone(), secrets);

---- redact::tests::tests::test_redact_task_registry_password stdout ----

thread 'redact::tests::tests::test_redact_task_registry_password' (707664) panicked at crates/twerk-core/src/redact/tests.rs:145:18:
called `Option::unwrap()` on a `None` value

---- redact::tests::tests::test_redact_task_env stdout ----

thread 'redact::tests::tests::test_redact_task_env' (707662) panicked at crates/twerk-core/src/redact/tests.rs:124:35:
called `Option::unwrap()` on a `None` value

failures:
    redact::tests::tests::test_redact_task_env
    redact::tests::tests::test_redact_task_registry_password

test result: FAILED. 607 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
