*** crates/twerk-core/src/domain_types.rs:285:29: replace * with + in parse_go_duration

*** mutation diff:
--- crates/twerk-core/src/domain_types.rs
+++ replace * with + in parse_go_duration
@@ -277,17 +277,17 @@
                 clippy::cast_precision_loss
             )]
             let result = (val * multiplier as f64) as u128;
             result
         } else {
             let val: u64 = num_str
                 .parse()
                 .map_err(|_| GoDurationError::ParseNumber(start))?;
-            u128::from(val) * multiplier
+            u128::from(val) + /* ~ changed by cargo-mutants ~ */ multiplier
         };
 
         // Safe: nanos won't exceed u64::MAX for any reasonable duration string
         total += Duration::from_nanos(u64::try_from(nanos).unwrap_or(u64::MAX));
         i += unit_len;
     }
 
     Ok(total)

---- domain_types::tests::go_duration_combo stdout ----

thread 'domain_types::tests::go_duration_combo' (2035551) panicked at crates/twerk-core/src/domain_types.rs:489:9:
assertion `left == right` failed
  left: 3660.000000031s
 right: 5400s

---- domain_types::tests::go_duration_days stdout ----

thread 'domain_types::tests::go_duration_days' (2035553) panicked at crates/twerk-core/src/domain_types.rs:495:9:
assertion `left == right` failed
  left: 86400.000000002s
 right: 172800s

---- domain_types::tests::go_duration_micros stdout ----

thread 'domain_types::tests::go_duration_micros' (2035556) panicked at crates/twerk-core/src/domain_types.rs:507:9:
assertion `left == right` failed
  left: 1.1µs
 right: 100µs

failures:
    domain_types::tests::go_duration_combo
    domain_types::tests::go_duration_complex
    domain_types::tests::go_duration_days
    domain_types::tests::go_duration_micros
    domain_types::tests::go_duration_millis
    domain_types::tests::go_duration_nanos
    domain_types::tests::go_duration_seconds
    trigger::data::tests::polling_trigger_new_returns_invalid_interval_when_interval_is_zero
    trigger::data_tests::pollingtrigger_tests::pollingtrigger_new_returns_invalid_interval_when_interval_is_zero
    trigger::data_tests::pollingtrigger_tests::pollingtrigger_new_returns_invalid_interval_when_timeout_is_zero

test result: FAILED. 599 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.76s

*** result: Failure(101)
