*** crates/twerk-core/src/id.rs:135:9: replace <impl Deserialize<'de> for TriggerId>::deserialize -> Result<Self, D::Error> with Ok(Default::default())

*** mutation diff:
--- crates/twerk-core/src/id.rs
+++ replace <impl Deserialize<'de> for TriggerId>::deserialize -> Result<Self, D::Error> with Ok(Default::default())
@@ -127,18 +127,17 @@
 #[serde(transparent)]
 pub struct TriggerId(String);
 
 impl<'de> Deserialize<'de> for TriggerId {
     fn deserialize<D>(deserializer: D) -> Result<Self, D::Error>
     where
         D: serde::Deserializer<'de>,
     {
-        let s: String = String::deserialize(deserializer)?;
-        Self::new(s).map_err(serde::de::Error::custom)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl TriggerId {
     /// Minimum length for a valid `TriggerId`.
     const MIN_LENGTH: usize = 3;
 
     /// Maximum length for a valid `TriggerId`.

---- id::tests::proptest_trigger_id_serde_roundtrip_preserves_string stdout ----

thread 'id::tests::proptest_trigger_id_serde_roundtrip_preserves_string' (740109) panicked at crates/twerk-core/src/id.rs:929:68:
called `Result::unwrap()` on an `Err` value: Error("trailing characters", line: 1, column: 1)

thread 'id::tests::proptest_trigger_id_serde_roundtrip_preserves_string' (740109) panicked at crates/twerk-core/src/id.rs:929:68:
called `Result::unwrap()` on an `Err` value: Error("trailing characters", line: 1, column: 1)

thread 'id::tests::proptest_trigger_id_serde_roundtrip_preserves_string' (740109) panicked at crates/twerk-core/src/id.rs:929:68:
called `Result::unwrap()` on an `Err` value: Error("trailing characters", line: 1, column: 1)

thread 'id::tests::proptest_trigger_id_serde_roundtrip_preserves_string' (740109) panicked at crates/twerk-core/src/id.rs:929:68:
called `Resul

---- id::tests::trigger_id_deserialize_rejects_2_char_string stdout ----

thread 'id::tests::trigger_id_deserialize_rejects_2_char_string' (740130) panicked at crates/twerk-core/src/id.rs:724:9:
assertion failed: err.to_string().contains("too short")

---- id::tests::trigger_id_deserialize_rejects_1_char_string stdout ----

thread 'id::tests::trigger_id_deserialize_rejects_1_char_string' (740129) panicked at crates/twerk-core/src/id.rs:731:9:
assertion failed: err.to_string().contains("too short")

failures:
    id::tests::proptest_trigger_id_serde_roundtrip_preserves_string
    id::tests::trigger_id_deserialize_rejects_1_char_string
    id::tests::trigger_id_deserialize_rejects_2_char_string
    id::tests::trigger_id_deserialize_rejects_65_char_string
    id::tests::trigger_id_deserialize_rejects_empty_string
    id::tests::trigger_id_deserializes_from_valid_json_string

test result: FAILED. 229 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.05s

*** result: Failure(101)
