*** crates/twerk-core/src/id.rs:202:9: replace <impl AsRef<str> for TriggerId>::as_ref -> &str with "xyzzy"

*** mutation diff:
--- crates/twerk-core/src/id.rs
+++ replace <impl AsRef<str> for TriggerId>::as_ref -> &str with "xyzzy"
@@ -194,17 +194,17 @@
 impl fmt::Display for TriggerId {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         write!(f, "{}", self.0)
     }
 }
 
 impl AsRef<str> for TriggerId {
     fn as_ref(&self) -> &str {
-        &self.0
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Deref for TriggerId {
     type Target = str;
 
     fn deref(&self) -> &Self::Target {
         &self.0

---- id::tests::trigger_id_as_ref_returns_inner_string stdout ----

thread 'id::tests::trigger_id_as_ref_returns_inner_string' (965654) panicked at crates/twerk-core/src/id.rs:802:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "ref-test"

failures:
    id::tests::trigger_id_as_ref_returns_inner_string

test result: FAILED. 234 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.00s

*** result: Failure(101)
