*** crates/twerk-core/src/redact.rs:225:25: delete field parallel from struct crate::task::Task expression in redact_task_parallel

*** mutation diff:
--- crates/twerk-core/src/redact.rs
+++ delete field parallel from struct crate::task::Task expression in redact_task_parallel
@@ -217,17 +217,17 @@
 fn redact_task_parallel(
     task: crate::task::Task,
     secrets: &HashMap<String, String>,
 ) -> crate::task::Task {
     let parallel = task.parallel.as_ref().map(|p| crate::task::ParallelTask {
         tasks: redact_nested_tasks(p.tasks.clone(), secrets),
         ..p.clone()
     });
-    crate::task::Task { parallel, ..task }
+    crate::task::Task {  /* ~ changed by cargo-mutants ~ */ ..task }
 }
 
 /// Redact pre, post, and sidecar nested tasks.
 fn redact_task_pre_post_sidecars(
     task: crate::task::Task,
     secrets: &HashMap<String, String>,
 ) -> crate::task::Task {
     let pre = redact_nested_tasks(task.pre.clone(), secrets);

---- rq2_serde_ts_pascal_case_accepted stdout ----

thread 'rq2_serde_ts_pascal_case_accepted' (720919) panicked at crates/twerk-core/tests/red_queen_gen2.rs:352:9:
serde must accept PascalCase "Active"

---- rq2_ts_serde_case_variants_rejected stdout ----

thread 'rq2_ts_serde_case_variants_rejected' (720943) panicked at crates/twerk-core/tests/red_queen_gen2.rs:75:9:
serde must accept "Active"

failures:
    rq2_serde_ts_pascal_case_accepted
    rq2_ts_serde_case_variants_rejected

test result: FAILED. 65 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
