*** crates/twerk-core/src/redact.rs:233:5: replace redact_task_pre_post_sidecars -> crate::task::Task with Default::default()

*** mutation diff:
--- crates/twerk-core/src/redact.rs
+++ replace redact_task_pre_post_sidecars -> crate::task::Task with Default::default()
@@ -225,25 +225,17 @@
     crate::task::Task { parallel, ..task }
 }
 
 /// Redact pre, post, and sidecar nested tasks.
 fn redact_task_pre_post_sidecars(
     task: crate::task::Task,
     secrets: &HashMap<String, String>,
 ) -> crate::task::Task {
-    let pre = redact_nested_tasks(task.pre.clone(), secrets);
-    let post = redact_nested_tasks(task.post.clone(), secrets);
-    let sidecars = redact_nested_tasks(task.sidecars.clone(), secrets);
-    crate::task::Task {
-        pre,
-        post,
-        sidecars,
-        ..task
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 // ---------------------------------------------------------------------------
 // Public API - pure functions, take by-value, return new instance
 // ---------------------------------------------------------------------------
 
 /// Redacts a task and all its nested tasks recursively.
 ///

---- redact::tests::tests::test_redact_task_env stdout ----

thread 'redact::tests::tests::test_redact_task_env' (725927) panicked at crates/twerk-core/src/redact/tests.rs:124:35:
called `Option::unwrap()` on a `None` value

---- redact::tests::tests::test_redact_task_registry_password stdout ----

thread 'redact::tests::tests::test_redact_task_registry_password' (725929) panicked at crates/twerk-core/src/redact/tests.rs:145:18:
called `Option::unwrap()` on a `None` value

failures:
    redact::tests::tests::test_redact_task_env
    redact::tests::tests::test_redact_task_registry_password

test result: FAILED. 607 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.61s

*** result: Failure(101)
