*** crates/twerk-core/src/id.rs:216:9: replace <impl Borrow<str> for TriggerId>::borrow -> &str with "xyzzy"

*** mutation diff:
--- crates/twerk-core/src/id.rs
+++ replace <impl Borrow<str> for TriggerId>::borrow -> &str with "xyzzy"
@@ -208,17 +208,17 @@
 
     fn deref(&self) -> &Self::Target {
         &self.0
     }
 }
 
 impl Borrow<str> for TriggerId {
     fn borrow(&self) -> &str {
-        &self.0
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl FromStr for TriggerId {
     type Err = IdError;
 
     fn from_str(s: &str) -> Result<Self, Self::Err> {
         Self::new(s)

---- id::tests::trigger_id_borrow_returns_inner_string stdout ----

thread 'id::tests::trigger_id_borrow_returns_inner_string' (755442) panicked at crates/twerk-core/src/id.rs:816:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "borrow-test"

failures:
    id::tests::trigger_id_borrow_returns_inner_string

test result: FAILED. 234 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.87s

*** result: Failure(101)
