*** crates/twerk-core/src/redact.rs:238:9: delete field post from struct crate::task::Task expression in redact_task_pre_post_sidecars

*** mutation diff:
--- crates/twerk-core/src/redact.rs
+++ delete field post from struct crate::task::Task expression in redact_task_pre_post_sidecars
@@ -230,17 +230,17 @@
     task: crate::task::Task,
     secrets: &HashMap<String, String>,
 ) -> crate::task::Task {
     let pre = redact_nested_tasks(task.pre.clone(), secrets);
     let post = redact_nested_tasks(task.post.clone(), secrets);
     let sidecars = redact_nested_tasks(task.sidecars.clone(), secrets);
     crate::task::Task {
         pre,
-        post,
+         /* ~ changed by cargo-mutants ~ */
         sidecars,
         ..task
     }
 }
 
 // ---------------------------------------------------------------------------
 // Public API - pure functions, take by-value, return new instance
 // ---------------------------------------------------------------------------

---- rq2_serde_ts_pascal_case_accepted stdout ----

thread 'rq2_serde_ts_pascal_case_accepted' (741408) panicked at crates/twerk-core/tests/red_queen_gen2.rs:352:9:
serde must accept PascalCase "Active"

---- rq2_ts_serde_case_variants_rejected stdout ----

thread 'rq2_ts_serde_case_variants_rejected' (741432) panicked at crates/twerk-core/tests/red_queen_gen2.rs:75:9:
serde must accept "Active"

failures:
    rq2_serde_ts_pascal_case_accepted
    rq2_ts_serde_case_variants_rejected

test result: FAILED. 65 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
