*** crates/twerk-core/src/id.rs:23:5: replace validate_id -> Result<(), IdError> with Ok(())

*** mutation diff:
--- crates/twerk-core/src/id.rs
+++ replace validate_id -> Result<(), IdError> with Ok(())
@@ -15,29 +15,17 @@
     TooShort(usize),
     #[error("ID is too long: {0} characters (maximum {MAX_ID_LENGTH})")]
     TooLong(usize),
     #[error("ID contains invalid characters: only alphanumeric, dash, and underscore allowed")]
     InvalidCharacters,
 }
 
 fn validate_id(s: &str) -> Result<(), IdError> {
-    if s.is_empty() {
-        return Err(IdError::Empty);
-    }
-    if s.len() > MAX_ID_LENGTH {
-        return Err(IdError::TooLong(s.len()));
-    }
-    if !s
-        .chars()
-        .all(|c| c.is_alphanumeric() || c == '-' || c == '_')
-    {
-        return Err(IdError::InvalidCharacters);
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 macro_rules! define_id {
     ($name:ident) => {
         #[derive(Debug, Clone, PartialEq, Eq, Hash, Serialize, Deserialize, Default)]
         #[serde(transparent)]
         pub struct $name(String);

---- id::tests::job_id_from_str_trait_error stdout ----

thread 'id::tests::job_id_from_str_trait_error' (856901) panicked at crates/twerk-core/src/id.rs:377:9:
assertion failed: matches!(result, Err(IdError::Empty))

---- id::tests::job_id_returns_err_empty_string stdout ----

thread 'id::tests::job_id_returns_err_empty_string' (856903) panicked at crates/twerk-core/src/id.rs:244:9:
assertion failed: matches!(result, Err(IdError::Empty))

---- id::tests::job_id_returns_err_when_exceeds_max_length stdout ----

thread 'id::tests::job_id_returns_err_when_exceeds_max_length' (856905) panicked at crates/twerk-core/src/id.rs:289:9:
assertion failed: matches!(result, Err(IdError::TooLong(1001)))

failures:
    id::tests::job_id_from_str_trait_error
    id::tests::job_id_returns_err_empty_string
    id::tests::job_id_returns_err_when_exceeds_max_length
    id::tests::job_id_returns_err_with_emoji
    id::tests::job_id_returns_err_with_newline
    id::tests::job_id_returns_err_with_null_byte
    id::tests::job_id_returns_err_with_slash
    id::tests::job_id_returns_err_with_space
    id::tests::job_id_returns_err_with_special_chars
    id::tests::job_id_returns_err_with_tab
    id::tests::node_id_new_too_long_rejected
    id::tests::role_id_new_empty_rejected

test result: FAILED. 215 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.71s

*** result: Failure(101)
