*** crates/twerk-core/src/redact.rs:257:5: replace redact_task -> crate::task::Task with Default::default()

*** mutation diff:
--- crates/twerk-core/src/redact.rs
+++ replace redact_task -> crate::task::Task with Default::default()
@@ -249,22 +249,17 @@
 ///
 /// Takes ownership and returns a new redacted task.
 #[must_use]
 #[allow(clippy::implicit_hasher)]
 pub fn redact_task(
     task: crate::task::Task,
     secrets: &HashMap<String, String>,
 ) -> crate::task::Task {
-    let task = redact_task_env(task, secrets);
-    let task = redact_task_mounts(task, secrets);
-    let task = redact_task_pre_post_sidecars(task, secrets);
-    let task = redact_task_parallel(task, secrets);
-    let task = redact_task_registry(task);
-    redact_task_subjob(task, secrets)
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Redacts task log parts by replacing secret values in contents.
 ///
 /// Takes ownership of the vec and returns a new redacted vec.
 #[must_use]
 #[allow(clippy::implicit_hasher)]
 pub fn redact_task_log_parts(

---- redact::tests::tests::test_redact_task_registry_password stdout ----

thread 'redact::tests::tests::test_redact_task_registry_password' (756152) panicked at crates/twerk-core/src/redact/tests.rs:145:18:
called `Option::unwrap()` on a `None` value

---- redact::tests::tests::test_redact_task_env stdout ----

thread 'redact::tests::tests::test_redact_task_env' (756146) panicked at crates/twerk-core/src/redact/tests.rs:124:35:
called `Option::unwrap()` on a `None` value

failures:
    redact::tests::tests::test_redact_task_env
    redact::tests::tests::test_redact_task_registry_password

test result: FAILED. 607 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.85s

*** result: Failure(101)
