*** crates/twerk-core/src/redact.rs:274:5: replace redact_task_log_parts -> Vec<crate::task::TaskLogPart> with vec![Default::default()]

*** mutation diff:
--- crates/twerk-core/src/redact.rs
+++ replace redact_task_log_parts -> Vec<crate::task::TaskLogPart> with vec![Default::default()]
@@ -266,31 +266,17 @@
 ///
 /// Takes ownership of the vec and returns a new redacted vec.
 #[must_use]
 #[allow(clippy::implicit_hasher)]
 pub fn redact_task_log_parts(
     parts: Vec<crate::task::TaskLogPart>,
     secrets: &HashMap<String, String>,
 ) -> Vec<crate::task::TaskLogPart> {
-    if secrets.is_empty() {
-        return parts;
-    }
-    parts
-        .into_iter()
-        .map(|part| {
-            let contents = part.contents.as_ref().map(|c| {
-                secrets
-                    .values()
-                    .filter(|sv| !sv.is_empty())
-                    .fold(c.clone(), |acc, sv| acc.replace(sv, REDACTED_STR))
-            });
-            crate::task::TaskLogPart { contents, ..part }
-        })
-        .collect()
+    vec![Default::default()] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Redact job inputs, webhooks, context, and tasks.
 fn redact_job_inputs_webhooks_context(
     job: crate::job::Job,
     secrets: &HashMap<String, String>,
 ) -> crate::job::Job {
     let inputs = job.inputs.as_ref().map(|i| redact_vars(i, secrets));

---- redact::tests::tests::test_redact_task_log_parts stdout ----

thread 'redact::tests::tests::test_redact_task_log_parts' (769890) panicked at crates/twerk-core/src/redact/tests.rs:165:43:
called `Option::unwrap()` on a `None` value

failures:
    redact::tests::tests::test_redact_task_log_parts

test result: FAILED. 608 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.57s

*** result: Failure(101)
