*** crates/twerk-core/src/id.rs:29:8: delete ! in validate_id

*** mutation diff:
--- crates/twerk-core/src/id.rs
+++ delete ! in validate_id
@@ -21,17 +21,17 @@
 
 fn validate_id(s: &str) -> Result<(), IdError> {
     if s.is_empty() {
         return Err(IdError::Empty);
     }
     if s.len() > MAX_ID_LENGTH {
         return Err(IdError::TooLong(s.len()));
     }
-    if !s
+    if  /* ~ changed by cargo-mutants ~ */s
         .chars()
         .all(|c| c.is_alphanumeric() || c == '-' || c == '_')
     {
         return Err(IdError::InvalidCharacters);
     }
     Ok(())
 }

---- id::tests::job_id_as_ref_trait stdout ----

thread 'id::tests::job_id_as_ref_trait' (903433) panicked at crates/twerk-core/src/id.rs:368:41:
called `Result::unwrap()` on an `Err` value: InvalidCharacters

---- id::tests::job_id_clone stdout ----

thread 'id::tests::job_id_clone' (903434) panicked at crates/twerk-core/src/id.rs:411:44:
called `Result::unwrap()` on an `Err` value: InvalidCharacters

---- id::tests::job_id_deref_trait stdout ----

thread 'id::tests::job_id_deref_trait' (903436) panicked at crates/twerk-core/src/id.rs:375:43:
called `Result::unwrap()` on an `Err` value: InvalidCharacters

failures:
    id::tests::job_id_as_ref_trait
    id::tests::job_id_clone
    id::tests::job_id_deref_trait
    id::tests::job_id_display_trait
    id::tests::job_id_eq_and_hash
    id::tests::job_id_from_str_trait
    id::tests::job_id_returns_err_with_emoji
    id::tests::job_id_returns_err_with_newline
    id::tests::job_id_returns_err_with_null_byte
    id::tests::job_id_returns_err_with_slash
    id::tests::job_id_returns_err_with_space
    id::tests::job_id_returns_err_with_special_chars

test result: FAILED. 186 passed; 49 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.24s

*** result: Failure(101)
