*** crates/twerk-core/src/id.rs:31:43: replace == with != in validate_id

*** mutation diff:
--- crates/twerk-core/src/id.rs
+++ replace == with != in validate_id
@@ -23,17 +23,17 @@
     if s.is_empty() {
         return Err(IdError::Empty);
     }
     if s.len() > MAX_ID_LENGTH {
         return Err(IdError::TooLong(s.len()));
     }
     if !s
         .chars()
-        .all(|c| c.is_alphanumeric() || c == '-' || c == '_')
+        .all(|c| c.is_alphanumeric() || c != /* ~ changed by cargo-mutants ~ */ '-' || c == '_')
     {
         return Err(IdError::InvalidCharacters);
     }
     Ok(())
 }
 
 macro_rules! define_id {
     ($name:ident) => {

---- id::tests::job_id_deref_trait stdout ----

thread 'id::tests::job_id_deref_trait' (736462) panicked at crates/twerk-core/src/id.rs:375:43:
called `Result::unwrap()` on an `Err` value: InvalidCharacters

---- id::tests::job_id_as_ref_trait stdout ----

thread 'id::tests::job_id_as_ref_trait' (736459) panicked at crates/twerk-core/src/id.rs:368:41:
called `Result::unwrap()` on an `Err` value: InvalidCharacters

---- id::tests::job_id_clone stdout ----

thread 'id::tests::job_id_clone' (736460) panicked at crates/twerk-core/src/id.rs:411:44:
called `Result::unwrap()` on an `Err` value: InvalidCharacters

failures:
    id::tests::job_id_as_ref_trait
    id::tests::job_id_clone
    id::tests::job_id_deref_trait
    id::tests::job_id_display_trait
    id::tests::job_id_eq_and_hash
    id::tests::job_id_from_str_trait
    id::tests::job_id_returns_err_with_newline
    id::tests::job_id_returns_err_with_null_byte
    id::tests::job_id_returns_err_with_slash
    id::tests::job_id_returns_err_with_space
    id::tests::job_id_returns_err_with_special_chars
    id::tests::job_id_returns_err_with_tab

test result: FAILED. 203 passed; 32 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.22s

*** result: Failure(101)
