*** crates/twerk-core/src/redact.rs:286:40: delete field contents from struct crate::task::TaskLogPart expression in redact_task_log_parts

*** mutation diff:
--- crates/twerk-core/src/redact.rs
+++ delete field contents from struct crate::task::TaskLogPart expression in redact_task_log_parts
@@ -278,17 +278,17 @@
         .into_iter()
         .map(|part| {
             let contents = part.contents.as_ref().map(|c| {
                 secrets
                     .values()
                     .filter(|sv| !sv.is_empty())
                     .fold(c.clone(), |acc, sv| acc.replace(sv, REDACTED_STR))
             });
-            crate::task::TaskLogPart { contents, ..part }
+            crate::task::TaskLogPart {  /* ~ changed by cargo-mutants ~ */ ..part }
         })
         .collect()
 }
 
 /// Redact job inputs, webhooks, context, and tasks.
 fn redact_job_inputs_webhooks_context(
     job: crate::job::Job,
     secrets: &HashMap<String, String>,

---- redact::tests::tests::test_redact_task_log_parts stdout ----

thread 'redact::tests::tests::test_redact_task_log_parts' (779914) panicked at crates/twerk-core/src/redact/tests.rs:164:9:
assertion `left == right` failed
  left: "Using token abc123 and password secret123"
 right: "Using token [REDACTED] and password secret123"

failures:
    redact::tests::tests::test_redact_task_log_parts

test result: FAILED. 608 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
