*** crates/twerk-core/src/id.rs:31:50: replace || with && in validate_id

*** mutation diff:
--- crates/twerk-core/src/id.rs
+++ replace || with && in validate_id
@@ -23,17 +23,17 @@
     if s.is_empty() {
         return Err(IdError::Empty);
     }
     if s.len() > MAX_ID_LENGTH {
         return Err(IdError::TooLong(s.len()));
     }
     if !s
         .chars()
-        .all(|c| c.is_alphanumeric() || c == '-' || c == '_')
+        .all(|c| c.is_alphanumeric() || c == '-' && /* ~ changed by cargo-mutants ~ */ c == '_')
     {
         return Err(IdError::InvalidCharacters);
     }
     Ok(())
 }
 
 macro_rules! define_id {
     ($name:ident) => {

---- id::tests::job_id_clone stdout ----

thread 'id::tests::job_id_clone' (726352) panicked at crates/twerk-core/src/id.rs:411:44:
called `Result::unwrap()` on an `Err` value: InvalidCharacters

---- id::tests::job_id_as_ref_trait stdout ----

thread 'id::tests::job_id_as_ref_trait' (726351) panicked at crates/twerk-core/src/id.rs:368:41:
called `Result::unwrap()` on an `Err` value: InvalidCharacters

---- id::tests::job_id_deref_trait stdout ----

thread 'id::tests::job_id_deref_trait' (726354) panicked at crates/twerk-core/src/id.rs:375:43:
called `Result::unwrap()` on an `Err` value: InvalidCharacters

failures:
    id::tests::job_id_as_ref_trait
    id::tests::job_id_clone
    id::tests::job_id_deref_trait
    id::tests::job_id_display_trait
    id::tests::job_id_eq_and_hash
    id::tests::job_id_from_str_trait
    id::tests::job_id_returns_ok_when_input_is_valid_alphanumeric
    id::tests::job_id_returns_ok_with_underscore
    id::tests::job_id_with_cjk_characters_is_accepted
    id::tests::node_id_new_valid
    id::tests::role_id_new_valid
    id::tests::scheduled_job_id_new_valid

test result: FAILED. 213 passed; 22 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.00s

*** result: Failure(101)
