*** crates/twerk-core/src/redact.rs:296:5: replace redact_job_inputs_webhooks_context -> crate::job::Job with Default::default()

*** mutation diff:
--- crates/twerk-core/src/redact.rs
+++ replace redact_job_inputs_webhooks_context -> crate::job::Job with Default::default()
@@ -288,40 +288,17 @@
         .collect()
 }
 
 /// Redact job inputs, webhooks, context, and tasks.
 fn redact_job_inputs_webhooks_context(
     job: crate::job::Job,
     secrets: &HashMap<String, String>,
 ) -> crate::job::Job {
-    let inputs = job.inputs.as_ref().map(|i| redact_vars(i, secrets));
-
-    let webhooks = job.webhooks.as_ref().map(|whs| {
-        whs.iter()
-            .map(|w| crate::webhook::Webhook {
-                headers: w.headers.as_ref().map(|h| redact_vars(h, secrets)),
-                ..w.clone()
-            })
-            .collect()
-    });
-
-    let context = job.context.as_ref().map(|ctx| crate::job::JobContext {
-        inputs: ctx.inputs.as_ref().map(|i| redact_vars(i, secrets)),
-        secrets: ctx.secrets.as_ref().map(|s| redact_vars(s, secrets)),
-        tasks: ctx.tasks.as_ref().map(|t| redact_vars(t, secrets)),
-        ..ctx.clone()
-    });
-
-    crate::job::Job {
-        inputs,
-        context,
-        webhooks,
-        ..job
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Redact all tasks and execution entries in a job.
 fn redact_job_tasks(job: crate::job::Job, secrets: &HashMap<String, String>) -> crate::job::Job {
     let tasks = redact_nested_tasks(job.tasks, secrets);
     let execution = redact_nested_tasks(job.execution, secrets);
     crate::job::Job {
         tasks,

---- redact::tests::tests::test_redact_job stdout ----

thread 'redact::tests::tests::test_redact_job' (785494) panicked at crates/twerk-core/src/redact/tests.rs:187:38:
called `Option::unwrap()` on a `None` value

failures:
    redact::tests::tests::test_redact_job

test result: FAILED. 608 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
