*** crates/twerk-core/src/trigger.rs:25:9: replace <impl fmt::Display for ParseTriggerStateError>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/twerk-core/src/trigger.rs
+++ replace <impl fmt::Display for ParseTriggerStateError>::fmt -> fmt::Result with Ok(Default::default())
@@ -17,17 +17,17 @@
 }
 
 /// Error returned when a string cannot be parsed as a [`TriggerState`].
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub struct ParseTriggerStateError(pub String);
 
 impl fmt::Display for ParseTriggerStateError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        write!(f, "unknown TriggerState: {}", self.0)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for ParseTriggerStateError {}
 
 impl fmt::Display for TriggerState {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         let name = match self {

---- trigger::tests::parse_trigger_state_error_displays_message stdout ----

thread 'trigger::tests::parse_trigger_state_error_displays_message' (756947) panicked at crates/twerk-core/src/trigger.rs:273:9:
assertion `left == right` failed
  left: ""
 right: "unknown TriggerState: bad"

failures:
    trigger::tests::parse_trigger_state_error_displays_message

test result: FAILED. 234 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.79s

*** result: Failure(101)
