*** crates/twerk-core/src/trigger.rs:33:9: replace <impl fmt::Display for TriggerState>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/twerk-core/src/trigger.rs
+++ replace <impl fmt::Display for TriggerState>::fmt -> fmt::Result with Ok(Default::default())
@@ -25,23 +25,17 @@
         write!(f, "unknown TriggerState: {}", self.0)
     }
 }
 
 impl std::error::Error for ParseTriggerStateError {}
 
 impl fmt::Display for TriggerState {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        let name = match self {
-            Self::Active => "ACTIVE",
-            Self::Paused => "PAUSED",
-            Self::Disabled => "DISABLED",
-            Self::Error => "ERROR",
-        };
-        f.write_str(name)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl FromStr for TriggerState {
     type Err = ParseTriggerStateError;
 
     fn from_str(s: &str) -> Result<Self, Self::Err> {
         match s.to_uppercase().as_str() {

---- trigger::tests::trigger_state_display_equals_serde_for_all_variants::case_2 stdout ----

thread 'trigger::tests::trigger_state_display_equals_serde_for_all_variants::case_2' (760488) panicked at crates/twerk-core/src/trigger.rs:258:9:
assertion `left == right` failed
  left: ""
 right: "PAUSED"

---- trigger::tests::trigger_state_display_formats_paused stdout ----

thread 'trigger::tests::trigger_state_display_formats_paused' (760494) panicked at crates/twerk-core/src/trigger.rs:109:9:
assertion `left == right` failed
  left: ""
 right: "PAUSED"

---- trigger::tests::trigger_state_display_equals_serde_for_all_variants::case_1 stdout ----

thread 'trigger::tests::trigger_state_display_equals_serde_for_all_variants::case_1' (760487) panicked at crates/twerk-core/src/trigger.rs:258:9:
assertion `left == right` failed
  left: ""
 right: "ACTIVE"

failures:
    trigger::tests::trigger_state_display_equals_serde_for_all_variants::case_1
    trigger::tests::trigger_state_display_equals_serde_for_all_variants::case_2
    trigger::tests::trigger_state_display_equals_serde_for_all_variants::case_3
    trigger::tests::trigger_state_display_equals_serde_for_all_variants::case_4
    trigger::tests::trigger_state_display_formats_active
    trigger::tests::trigger_state_display_formats_disabled
    trigger::tests::trigger_state_display_formats_error
    trigger::tests::trigger_state_display_formats_paused

test result: FAILED. 227 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.11s

*** result: Failure(101)
