*** crates/twerk-core/src/redact.rs:301:17: delete field headers from struct crate::webhook::Webhook expression in redact_job_inputs_webhooks_context

*** mutation diff:
--- crates/twerk-core/src/redact.rs
+++ delete field headers from struct crate::webhook::Webhook expression in redact_job_inputs_webhooks_context
@@ -293,17 +293,17 @@
     job: crate::job::Job,
     secrets: &HashMap<String, String>,
 ) -> crate::job::Job {
     let inputs = job.inputs.as_ref().map(|i| redact_vars(i, secrets));
 
     let webhooks = job.webhooks.as_ref().map(|whs| {
         whs.iter()
             .map(|w| crate::webhook::Webhook {
-                headers: w.headers.as_ref().map(|h| redact_vars(h, secrets)),
+                 /* ~ changed by cargo-mutants ~ */
                 ..w.clone()
             })
             .collect()
     });
 
     let context = job.context.as_ref().map(|ctx| crate::job::JobContext {
         inputs: ctx.inputs.as_ref().map(|i| redact_vars(i, secrets)),
         secrets: ctx.secrets.as_ref().map(|s| redact_vars(s, secrets)),

---- rq2_serde_ts_pascal_case_accepted stdout ----

thread 'rq2_serde_ts_pascal_case_accepted' (792969) panicked at crates/twerk-core/tests/red_queen_gen2.rs:352:9:
serde must accept PascalCase "Active"

---- rq2_ts_serde_case_variants_rejected stdout ----

thread 'rq2_ts_serde_case_variants_rejected' (792993) panicked at crates/twerk-core/tests/red_queen_gen2.rs:75:9:
serde must accept "Active"

failures:
    rq2_serde_ts_pascal_case_accepted
    rq2_ts_serde_case_variants_rejected

test result: FAILED. 65 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
