*** crates/twerk-core/src/trigger.rs:47:9: replace <impl FromStr for TriggerState>::from_str -> Result<Self, Self::Err> with Ok(Default::default())

*** mutation diff:
--- crates/twerk-core/src/trigger.rs
+++ replace <impl FromStr for TriggerState>::from_str -> Result<Self, Self::Err> with Ok(Default::default())
@@ -39,23 +39,17 @@
         f.write_str(name)
     }
 }
 
 impl FromStr for TriggerState {
     type Err = ParseTriggerStateError;
 
     fn from_str(s: &str) -> Result<Self, Self::Err> {
-        match s.to_uppercase().as_str() {
-            "ACTIVE" => Ok(Self::Active),
-            "PAUSED" => Ok(Self::Paused),
-            "DISABLED" => Ok(Self::Disabled),
-            "ERROR" => Ok(Self::Error),
-            _ => Err(ParseTriggerStateError(s.to_string())),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // =========================================================================
 // TESTS — RED PHASE
 // =========================================================================
 
 #[cfg(test)]

---- trigger::tests::proptest_trigger_state_from_str_ignores_case stdout ----

thread 'trigger::tests::proptest_trigger_state_from_str_ignores_case' (761704) panicked at crates/twerk-core/src/trigger.rs:343:5:
Test failed: assertion failed: `(left == right)` 
  left: `Active`,
 right: `Paused` at crates/twerk-core/src/trigger.rs:382.
minimal failing input: (input, expected) = (
    "paused",
    Paused,
)
	successes: 0
	local rejects: 0
	global rejects: 0

---- trigger::tests::trigger_state_parse_rejects_empty_string stdout ----

thread 'trigger::tests::trigger_state_parse_rejects_empty_string' (761736) panicked at crates/twerk-core/src/trigger.rs:175:9:
assertion `left == right` failed
  left: Ok(Active)
 right: Err(ParseTriggerStateError(""))

---- trigger::tests::trigger_state_parse_rejects_trailing_whitespace stdout ----

thread 'trigger::tests::trigger_state_parse_rejects_trailing_whitespace' (761738) panicked at crates/twerk-core/src/trigger.rs:196:9:
assertion `left == right` failed
  left: Ok(Active)
 right: Err(ParseTriggerStateError("ACTIVE "))

failures:
    trigger::tests::proptest_trigger_state_from_str_ignores_case
    trigger::tests::trigger_state_parse_rejects_empty_string
    trigger::tests::trigger_state_parse_rejects_prefix_of_valid_name
    trigger::tests::trigger_state_parse_rejects_trailing_whitespace
    trigger::tests::trigger_state_parse_rejects_unknown_string
    trigger::tests::trigger_state_parse_rejects_whitespace_only
    trigger::tests::trigger_state_parses_lowercase_error
    trigger::tests::trigger_state_parses_mixed_case_paused

test result: FAILED. 227 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.39s

*** result: Failure(101)
