*** crates/twerk-core/src/redact.rs:308:9: delete field inputs from struct crate::job::JobContext expression in redact_job_inputs_webhooks_context

*** mutation diff:
--- crates/twerk-core/src/redact.rs
+++ delete field inputs from struct crate::job::JobContext expression in redact_job_inputs_webhooks_context
@@ -300,17 +300,17 @@
             .map(|w| crate::webhook::Webhook {
                 headers: w.headers.as_ref().map(|h| redact_vars(h, secrets)),
                 ..w.clone()
             })
             .collect()
     });
 
     let context = job.context.as_ref().map(|ctx| crate::job::JobContext {
-        inputs: ctx.inputs.as_ref().map(|i| redact_vars(i, secrets)),
+         /* ~ changed by cargo-mutants ~ */
         secrets: ctx.secrets.as_ref().map(|s| redact_vars(s, secrets)),
         tasks: ctx.tasks.as_ref().map(|t| redact_vars(t, secrets)),
         ..ctx.clone()
     });
 
     crate::job::Job {
         inputs,
         context,

---- rq2_serde_ts_pascal_case_accepted stdout ----

thread 'rq2_serde_ts_pascal_case_accepted' (799444) panicked at crates/twerk-core/tests/red_queen_gen2.rs:352:9:
serde must accept PascalCase "Active"

---- rq2_ts_serde_case_variants_rejected stdout ----

thread 'rq2_ts_serde_case_variants_rejected' (799468) panicked at crates/twerk-core/tests/red_queen_gen2.rs:75:9:
serde must accept "Active"

failures:
    rq2_serde_ts_pascal_case_accepted
    rq2_ts_serde_case_variants_rejected

test result: FAILED. 65 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
