*** crates/twerk-core/src/trigger.rs:50:13: delete match arm "DISABLED" in <impl FromStr for TriggerState>::from_str

*** mutation diff:
--- crates/twerk-core/src/trigger.rs
+++ delete match arm "DISABLED" in <impl FromStr for TriggerState>::from_str
@@ -42,17 +42,17 @@
 
 impl FromStr for TriggerState {
     type Err = ParseTriggerStateError;
 
     fn from_str(s: &str) -> Result<Self, Self::Err> {
         match s.to_uppercase().as_str() {
             "ACTIVE" => Ok(Self::Active),
             "PAUSED" => Ok(Self::Paused),
-            "DISABLED" => Ok(Self::Disabled),
+             /* ~ changed by cargo-mutants ~ */
             "ERROR" => Ok(Self::Error),
             _ => Err(ParseTriggerStateError(s.to_string())),
         }
     }
 }
 
 // =========================================================================
 // TESTS — RED PHASE

---- trigger::tests::proptest_trigger_state_from_str_ignores_case stdout ----

thread 'trigger::tests::proptest_trigger_state_from_str_ignores_case' (769164) panicked at crates/twerk-core/src/trigger.rs:387:54:
called `Result::unwrap()` on an `Err` value: ParseTriggerStateError("disabled")

thread 'trigger::tests::proptest_trigger_state_from_str_ignores_case' (769164) panicked at crates/twerk-core/src/trigger.rs:387:54:
called `Result::unwrap()` on an `Err` value: ParseTriggerStateError("disabled")

thread 'trigger::tests::proptest_trigger_state_from_str_ignores_case' (769164) panicked at crates/twerk-core/src/trigger.rs:349:5:
Test failed: called `Result::unwrap()` on an `Err` value: ParseTriggerStateError("disabled").
minimal failing input: (input, expected) = (
    "disabled",
    Disabled,
)

failures:
    trigger::tests::proptest_trigger_state_from_str_ignores_case

test result: FAILED. 234 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.14s

*** result: Failure(101)
