*** crates/twerk-core/src/trigger.rs:51:13: delete match arm "ERROR" in <impl FromStr for TriggerState>::from_str

*** mutation diff:
--- crates/twerk-core/src/trigger.rs
+++ delete match arm "ERROR" in <impl FromStr for TriggerState>::from_str
@@ -43,17 +43,17 @@
 impl FromStr for TriggerState {
     type Err = ParseTriggerStateError;
 
     fn from_str(s: &str) -> Result<Self, Self::Err> {
         match s.to_uppercase().as_str() {
             "ACTIVE" => Ok(Self::Active),
             "PAUSED" => Ok(Self::Paused),
             "DISABLED" => Ok(Self::Disabled),
-            "ERROR" => Ok(Self::Error),
+             /* ~ changed by cargo-mutants ~ */
             _ => Err(ParseTriggerStateError(s.to_string())),
         }
     }
 }
 
 // =========================================================================
 // TESTS — RED PHASE
 // =========================================================================

---- trigger::tests::trigger_state_parses_lowercase_error stdout ----

thread 'trigger::tests::trigger_state_parses_lowercase_error' (769846) panicked at crates/twerk-core/src/trigger.rs:159:45:
called `Result::unwrap()` on an `Err` value: ParseTriggerStateError("error")

---- trigger::tests::proptest_trigger_state_from_str_ignores_case stdout ----

thread 'trigger::tests::proptest_trigger_state_from_str_ignores_case' (769811) panicked at crates/twerk-core/src/trigger.rs:387:54:
called `Result::unwrap()` on an `Err` value: ParseTriggerStateError("ERROR")

thread 'trigger::tests::proptest_trigger_state_from_str_ignores_case' (769811) panicked at crates/twerk-core/src/trigger.rs:387:54:
called `Result::unwrap()` on an `Err` value: ParseTriggerStateError("error")

thread 'trigger::tests::proptest_trigger_state_from_str_ignores_case' (769811) panicked at crates/twerk-core/src/trigger.rs:387:54:
called `Result::unwrap()` on an `Err` value: ParseTriggerStateError("error")
proptest: Saving this and future failures in /tmp/cargo-mutants-twerk-p4m-YhxBi1.tmp/crates/twerk-core/proptest-regressions/trigger.txt
proptest: If this test was run on a CI system, you may w

failures:
    trigger::tests::proptest_trigger_state_from_str_ignores_case
    trigger::tests::trigger_state_parses_lowercase_error

test result: FAILED. 233 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.54s

*** result: Failure(101)
