*** crates/twerk-core/src/domain_types.rs:192:9: replace GoDuration::to_duration -> Duration with Default::default()

*** mutation diff:
--- crates/twerk-core/src/domain_types.rs
+++ replace GoDuration::to_duration -> Duration with Default::default()
@@ -184,18 +184,17 @@
     }
 
     /// Convert to a `std::time::Duration`.
     ///
     /// Since `Self` is only constructible via `new()` which validates the format,
     /// this method is guaranteed to succeed.
     #[must_use]
     pub fn to_duration(&self) -> Duration {
-        parse_go_duration(&self.0)
-            .unwrap_or_else(|e| unreachable!("GoDuration was validated at construction: {e}"))
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// View the original Go-style duration string.
     #[must_use]
     pub fn as_str(&self) -> &str {
         &self.0
     }
 }

---- domain_types::tests::go_duration_complex stdout ----

thread 'domain_types::tests::go_duration_complex' (2280518) panicked at crates/twerk-core/src/domain_types.rs:520:9:
assertion `left == right` failed
  left: 0ns
 right: 217815.5s

---- domain_types::tests::go_duration_combo stdout ----

thread 'domain_types::tests::go_duration_combo' (2280517) panicked at crates/twerk-core/src/domain_types.rs:488:9:
assertion `left == right` failed
  left: 0ns
 right: 5400s

---- domain_types::tests::go_duration_micros stdout ----

thread 'domain_types::tests::go_duration_micros' (2280522) panicked at crates/twerk-core/src/domain_types.rs:506:9:
assertion `left == right` failed
  left: 0ns
 right: 100µs

failures:
    domain_types::tests::go_duration_combo
    domain_types::tests::go_duration_complex
    domain_types::tests::go_duration_days
    domain_types::tests::go_duration_micros
    domain_types::tests::go_duration_millis
    domain_types::tests::go_duration_nanos
    domain_types::tests::go_duration_seconds
    trigger::data::tests::polling_trigger_new_returns_ok_when_all_fields_valid
    trigger::data::tests::trigger_polling_roundtrip_serialization
    trigger::data_tests::additional_coverage_tests::pollingtrigger_deserialization_minimal
    trigger::data_tests::additional_coverage_tests::pollingtrigger_deserialization_with_all_fields
    trigger::data_tests::additional_coverage_tests::pollingtrigger_new_accepts_large_timeout

test result: FAILED. 567 passed; 42 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.71s

*** result: Failure(101)
