*** crates/twerk-core/src/redact.rs:315:9: delete field inputs from struct crate::job::Job expression in redact_job_inputs_webhooks_context

*** mutation diff:
--- crates/twerk-core/src/redact.rs
+++ delete field inputs from struct crate::job::Job expression in redact_job_inputs_webhooks_context
@@ -307,17 +307,17 @@
     let context = job.context.as_ref().map(|ctx| crate::job::JobContext {
         inputs: ctx.inputs.as_ref().map(|i| redact_vars(i, secrets)),
         secrets: ctx.secrets.as_ref().map(|s| redact_vars(s, secrets)),
         tasks: ctx.tasks.as_ref().map(|t| redact_vars(t, secrets)),
         ..ctx.clone()
     });
 
     crate::job::Job {
-        inputs,
+         /* ~ changed by cargo-mutants ~ */
         context,
         webhooks,
         ..job
     }
 }
 
 /// Redact all tasks and execution entries in a job.
 fn redact_job_tasks(job: crate::job::Job, secrets: &HashMap<String, String>) -> crate::job::Job {

---- redact::tests::tests::test_redact_job stdout ----

thread 'redact::tests::tests::test_redact_job' (820484) panicked at crates/twerk-core/src/redact/tests.rs:188:9:
assertion `left == right` failed
  left: "Using token abc123"
 right: "Using token [REDACTED]"

failures:
    redact::tests::tests::test_redact_job

test result: FAILED. 608 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.59s

*** result: Failure(101)
