*** crates/twerk-core/src/domain_types.rs:222:5: replace parse_go_duration -> Result<Duration, GoDurationError> with Ok(Default::default())

*** mutation diff:
--- crates/twerk-core/src/domain_types.rs
+++ replace parse_go_duration -> Result<Duration, GoDurationError> with Ok(Default::default())
@@ -214,88 +214,17 @@
     }
 }
 
 /// Parse a Go-style duration string into a [`Duration`].
 ///
 /// Supported units: `ns`, `us`/`µs`, `ms`, `s`, `m`, `h`, `d`.
 /// Segments can be combined, e.g. `"1h30m"`, `"2d12h30m"`.
 fn parse_go_duration(s: &str) -> Result<Duration, GoDurationError> {
-    if s.is_empty() {
-        return Err(GoDurationError::Empty);
-    }
-
-    let mut total = Duration::ZERO;
-    let bytes = s.as_bytes();
-    let mut i = 0;
-
-    while i < bytes.len() {
-        // Read the numeric part.
-        let start = i;
-        while i < bytes.len() && (bytes[i].is_ascii_digit() || bytes[i] == b'.') {
-            i += 1;
-        }
-        if i == start {
-            // No digits found.
-            return Err(GoDurationError::ParseNumber(start));
-        }
-        let num_str = &s[start..i];
-        let is_float = num_str.contains('.');
-
-        // Determine the unit.
-        if i >= bytes.len() {
-            return Err(GoDurationError::NoUnit(start));
-        }
-
-        let (unit_len, multiplier): (usize, u128) = if s[i..].starts_with("ns") {
-            (2, 1)
-        } else if s[i..].starts_with("us") {
-            (2, 1_000)
-        } else if s[i..].starts_with("\u{00b5}s") {
-            // µs (micro sign U+00B5)
-            ("\u{00b5}s".len(), 1_000)
-        } else if s[i..].starts_with("ms") {
-            (2, 1_000_000)
-        } else if s[i..].starts_with('s') {
-            (1, 1_000_000_000)
-        } else if s[i..].starts_with('m') {
-            (1, 60_000_000_000)
-        } else if s[i..].starts_with('h') {
-            (1, 3_600_000_000_000)
-        } else if s[i..].starts_with('d') {
-            (1, 86_400_000_000_000)
-        } else {
-            return Err(GoDurationError::UnknownUnit(bytes[i] as char));
-        };
-
-        let nanos = if is_float {
-            let val: f64 = num_str
-                .parse()
-                .map_err(|_| GoDurationError::ParseNumber(start))?;
-            // Safe: multiplier fits in f64 without precision loss for reasonable durations
-            #[allow(
-                clippy::cast_possible_truncation,
-                clippy::cast_sign_loss,
-                clippy::cast_precision_loss
-            )]
-            let result = (val * multiplier as f64) as u128;
-            result
-        } else {
-            let val: u64 = num_str
-                .parse()
-                .map_err(|_| GoDurationError::ParseNumber(start))?;
-            u128::from(val) * multiplier
-        };
-
-        // Safe: nanos won't exceed u64::MAX for any reasonable duration string
-        total += Duration::from_nanos(u64::try_from(nanos).unwrap_or(u64::MAX));
-        i += unit_len;
-    }
-
-    Ok(total)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 // ---------------------------------------------------------------------------
 // Priority
 // ---------------------------------------------------------------------------
 
 /// A validated job/Task priority value (0-9).
 ///

---- domain_types::tests::go_duration_complex stdout ----

thread 'domain_types::tests::go_duration_complex' (2316673) panicked at crates/twerk-core/src/domain_types.rs:450:9:
assertion `left == right` failed
  left: 0ns
 right: 217815.5s

---- domain_types::tests::go_duration_days stdout ----

thread 'domain_types::tests::go_duration_days' (2316674) panicked at crates/twerk-core/src/domain_types.rs:424:9:
assertion `left == right` failed
  left: 0ns
 right: 172800s

---- domain_types::tests::go_duration_nanos stdout ----

thread 'domain_types::tests::go_duration_nanos' (2316679) panicked at crates/twerk-core/src/domain_types.rs:442:9:
assertion `left == right` failed
  left: 0ns
 right: 100ns

failures:
    domain_types::tests::go_duration_combo
    domain_types::tests::go_duration_complex
    domain_types::tests::go_duration_days
    domain_types::tests::go_duration_micros
    domain_types::tests::go_duration_millis
    domain_types::tests::go_duration_nanos
    domain_types::tests::go_duration_seconds
    trigger::data::tests::polling_trigger_new_returns_ok_when_all_fields_valid
    trigger::data::tests::trigger_polling_roundtrip_serialization
    trigger::data_tests::additional_coverage_tests::pollingtrigger_deserialization_minimal
    trigger::data_tests::additional_coverage_tests::pollingtrigger_deserialization_with_all_fields
    trigger::data_tests::additional_coverage_tests::pollingtrigger_new_accepts_large_timeout

test result: FAILED. 567 passed; 42 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.75s

*** result: Failure(101)
