*** crates/twerk-core/src/redact.rs:316:9: delete field context from struct crate::job::Job expression in redact_job_inputs_webhooks_context

*** mutation diff:
--- crates/twerk-core/src/redact.rs
+++ delete field context from struct crate::job::Job expression in redact_job_inputs_webhooks_context
@@ -308,17 +308,17 @@
         inputs: ctx.inputs.as_ref().map(|i| redact_vars(i, secrets)),
         secrets: ctx.secrets.as_ref().map(|s| redact_vars(s, secrets)),
         tasks: ctx.tasks.as_ref().map(|t| redact_vars(t, secrets)),
         ..ctx.clone()
     });
 
     crate::job::Job {
         inputs,
-        context,
+         /* ~ changed by cargo-mutants ~ */
         webhooks,
         ..job
     }
 }
 
 /// Redact all tasks and execution entries in a job.
 fn redact_job_tasks(job: crate::job::Job, secrets: &HashMap<String, String>) -> crate::job::Job {
     let tasks = redact_nested_tasks(job.tasks, secrets);

---- rq2_serde_ts_pascal_case_accepted stdout ----

thread 'rq2_serde_ts_pascal_case_accepted' (829275) panicked at crates/twerk-core/tests/red_queen_gen2.rs:352:9:
serde must accept PascalCase "Active"

---- rq2_ts_serde_case_variants_rejected stdout ----

thread 'rq2_ts_serde_case_variants_rejected' (829300) panicked at crates/twerk-core/tests/red_queen_gen2.rs:75:9:
serde must accept "Active"

failures:
    rq2_serde_ts_pascal_case_accepted
    rq2_ts_serde_case_variants_rejected

test result: FAILED. 65 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
