*** crates/twerk-core/src/redact.rs:324:5: replace redact_job_tasks -> crate::job::Job with Default::default()

*** mutation diff:
--- crates/twerk-core/src/redact.rs
+++ replace redact_job_tasks -> crate::job::Job with Default::default()
@@ -316,23 +316,17 @@
         context,
         webhooks,
         ..job
     }
 }
 
 /// Redact all tasks and execution entries in a job.
 fn redact_job_tasks(job: crate::job::Job, secrets: &HashMap<String, String>) -> crate::job::Job {
-    let tasks = redact_nested_tasks(job.tasks, secrets);
-    let execution = redact_nested_tasks(job.execution, secrets);
-    crate::job::Job {
-        tasks,
-        execution,
-        ..job
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Redact the job's own secrets map (values become `\[REDACTED\]`).
 fn redact_job_secrets(job: crate::job::Job) -> crate::job::Job {
     let secrets = job.secrets.as_ref().map(|s| {
         s.keys()
             .map(|k| (k.clone(), REDACTED_STR.to_string()))
             .collect()

---- redact::tests::tests::test_redact_job stdout ----

thread 'redact::tests::tests::test_redact_job' (836392) panicked at crates/twerk-core/src/redact/tests.rs:187:38:
called `Option::unwrap()` on a `None` value

failures:
    redact::tests::tests::test_redact_job

test result: FAILED. 608 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.57s

*** result: Failure(101)
