*** crates/twerk-core/src/redact.rs:335:5: replace redact_job_secrets -> crate::job::Job with Default::default()

*** mutation diff:
--- crates/twerk-core/src/redact.rs
+++ replace redact_job_secrets -> crate::job::Job with Default::default()
@@ -327,22 +327,17 @@
         tasks,
         execution,
         ..job
     }
 }
 
 /// Redact the job's own secrets map (values become `\[REDACTED\]`).
 fn redact_job_secrets(job: crate::job::Job) -> crate::job::Job {
-    let secrets = job.secrets.as_ref().map(|s| {
-        s.keys()
-            .map(|k| (k.clone(), REDACTED_STR.to_string()))
-            .collect()
-    });
-    crate::job::Job { secrets, ..job }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Redacts a job and all its tasks.
 ///
 /// Takes ownership and returns a new redacted job.
 #[must_use]
 pub fn redact_job(job: crate::job::Job) -> crate::job::Job {
     let secrets = job.secrets.clone().unwrap_or_default();

---- redact::tests::tests::test_redact_job stdout ----

thread 'redact::tests::tests::test_redact_job' (843076) panicked at crates/twerk-core/src/redact/tests.rs:187:38:
called `Option::unwrap()` on a `None` value

failures:
    redact::tests::tests::test_redact_job

test result: FAILED. 608 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.55s

*** result: Failure(101)
