*** crates/twerk-core/src/redact.rs:348:5: replace redact_job -> crate::job::Job with Default::default()

*** mutation diff:
--- crates/twerk-core/src/redact.rs
+++ replace redact_job -> crate::job::Job with Default::default()
@@ -340,13 +340,10 @@
     crate::job::Job { secrets, ..job }
 }
 
 /// Redacts a job and all its tasks.
 ///
 /// Takes ownership and returns a new redacted job.
 #[must_use]
 pub fn redact_job(job: crate::job::Job) -> crate::job::Job {
-    let secrets = job.secrets.clone().unwrap_or_default();
-    let job = redact_job_inputs_webhooks_context(job, &secrets);
-    let job = redact_job_tasks(job, &secrets);
-    redact_job_secrets(job)
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }

---- redact::tests::tests::test_redact_job stdout ----

thread 'redact::tests::tests::test_redact_job' (847913) panicked at crates/twerk-core/src/redact/tests.rs:187:38:
called `Option::unwrap()` on a `None` value

failures:
    redact::tests::tests::test_redact_job

test result: FAILED. 608 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.90s

*** result: Failure(101)
