*** crates/twerk-core/src/domain_types.rs:234:15: replace += with *= in parse_go_duration

*** mutation diff:
--- crates/twerk-core/src/domain_types.rs
+++ replace += with *= in parse_go_duration
@@ -226,17 +226,17 @@
     let mut total = Duration::ZERO;
     let bytes = s.as_bytes();
     let mut i = 0;
 
     while i < bytes.len() {
         // Read the numeric part.
         let start = i;
         while i < bytes.len() && (bytes[i].is_ascii_digit() || bytes[i] == b'.') {
-            i += 1;
+            i *= /* ~ changed by cargo-mutants ~ */ 1;
         }
         if i == start {
             // No digits found.
             return Err(GoDurationError::ParseNumber(start));
         }
         let num_str = &s[start..i];
         let is_float = num_str.contains('.');

*** result: Timeout
