*** crates/twerk-core/src/domain_types.rs:285:29: replace * with / in parse_go_duration

*** mutation diff:
--- crates/twerk-core/src/domain_types.rs
+++ replace * with / in parse_go_duration
@@ -277,17 +277,17 @@
                 clippy::cast_precision_loss
             )]
             let result = (val * multiplier as f64) as u128;
             result
         } else {
             let val: u64 = num_str
                 .parse()
                 .map_err(|_| GoDurationError::ParseNumber(start))?;
-            u128::from(val) * multiplier
+            u128::from(val) / /* ~ changed by cargo-mutants ~ */ multiplier
         };
 
         // Safe: nanos won't exceed u64::MAX for any reasonable duration string
         total += Duration::from_nanos(u64::try_from(nanos).unwrap_or(u64::MAX));
         i += unit_len;
     }
 
     Ok(total)

---- domain_types::tests::go_duration_days stdout ----

thread 'domain_types::tests::go_duration_days' (2611251) panicked at crates/twerk-core/src/domain_types.rs:495:9:
assertion `left == right` failed
  left: 0ns
 right: 172800s

---- domain_types::tests::go_duration_complex stdout ----

thread 'domain_types::tests::go_duration_complex' (2611250) panicked at crates/twerk-core/src/domain_types.rs:521:9:
assertion `left == right` failed
  left: 0ns
 right: 217815.5s

---- domain_types::tests::go_duration_combo stdout ----

thread 'domain_types::tests::go_duration_combo' (2611249) panicked at crates/twerk-core/src/domain_types.rs:489:9:
assertion `left == right` failed
  left: 0ns
 right: 5400s

failures:
    domain_types::tests::go_duration_combo
    domain_types::tests::go_duration_complex
    domain_types::tests::go_duration_days
    domain_types::tests::go_duration_micros
    domain_types::tests::go_duration_millis
    domain_types::tests::go_duration_seconds
    trigger::data::tests::polling_trigger_new_returns_ok_when_all_fields_valid
    trigger::data::tests::trigger_polling_roundtrip_serialization
    trigger::data_tests::additional_coverage_tests::pollingtrigger_deserialization_minimal
    trigger::data_tests::additional_coverage_tests::pollingtrigger_deserialization_with_all_fields
    trigger::data_tests::additional_coverage_tests::pollingtrigger_new_accepts_large_timeout
    trigger::data_tests::additional_coverage_tests::pollingtrigger_new_accepts_long_url

test result: FAILED. 568 passed; 41 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.65s

*** result: Failure(101)
