*** crates/twerk-core/src/domain_types.rs:289:15: replace += with -= in parse_go_duration

*** mutation diff:
--- crates/twerk-core/src/domain_types.rs
+++ replace += with -= in parse_go_duration
@@ -281,17 +281,17 @@
         } else {
             let val: u64 = num_str
                 .parse()
                 .map_err(|_| GoDurationError::ParseNumber(start))?;
             u128::from(val) * multiplier
         };
 
         // Safe: nanos won't exceed u64::MAX for any reasonable duration string
-        total += Duration::from_nanos(u64::try_from(nanos).unwrap_or(u64::MAX));
+        total -= /* ~ changed by cargo-mutants ~ */ Duration::from_nanos(u64::try_from(nanos).unwrap_or(u64::MAX));
         i += unit_len;
     }
 
     Ok(total)
 }
 
 // ---------------------------------------------------------------------------
 // Priority

---- domain_types::tests::go_duration_seconds stdout ----

thread 'domain_types::tests::go_duration_seconds' (2619513) panicked at /rustc/4a4ef493e3a1488c6e321570238084b38948f6db/library/core/src/time.rs:1203:31:
overflow when subtracting durations

---- domain_types::tests::go_duration_combo stdout ----

thread 'domain_types::tests::go_duration_combo' (2619505) panicked at /rustc/4a4ef493e3a1488c6e321570238084b38948f6db/library/core/src/time.rs:1203:31:
overflow when subtracting durations

---- domain_types::tests::go_duration_complex stdout ----

thread 'domain_types::tests::go_duration_complex' (2619506) panicked at /rustc/4a4ef493e3a1488c6e321570238084b38948f6db/library/core/src/time.rs:1203:31:
overflow when subtracting durations

failures:
    domain_types::tests::go_duration_combo
    domain_types::tests::go_duration_complex
    domain_types::tests::go_duration_days
    domain_types::tests::go_duration_from_str_roundtrip
    domain_types::tests::go_duration_micros
    domain_types::tests::go_duration_millis
    domain_types::tests::go_duration_nanos
    domain_types::tests::go_duration_seconds
    trigger::data::tests::polling_trigger_new_returns_ok_when_all_fields_valid
    trigger::data::tests::trigger_polling_roundtrip_serialization
    trigger::data_tests::additional_coverage_tests::pollingtrigger_deserialization_minimal
    trigger::data_tests::additional_coverage_tests::pollingtrigger_deserialization_with_all_fields

test result: FAILED. 557 passed; 52 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.85s

*** result: Failure(101)
