*** crates/twerk-core/src/domain_types.rs:290:11: replace += with -= in parse_go_duration

*** mutation diff:
--- crates/twerk-core/src/domain_types.rs
+++ replace += with -= in parse_go_duration
@@ -282,17 +282,17 @@
             let val: u64 = num_str
                 .parse()
                 .map_err(|_| GoDurationError::ParseNumber(start))?;
             u128::from(val) * multiplier
         };
 
         // Safe: nanos won't exceed u64::MAX for any reasonable duration string
         total += Duration::from_nanos(u64::try_from(nanos).unwrap_or(u64::MAX));
-        i += unit_len;
+        i -= /* ~ changed by cargo-mutants ~ */ unit_len;
     }
 
     Ok(total)
 }
 
 // ---------------------------------------------------------------------------
 // Priority
 // ---------------------------------------------------------------------------

*** result: Success
