*** crates/twerk-core/src/id.rs:184:9: replace <impl From<String> for TriggerId>::from -> Self with Default::default()

*** mutation diff:
--- crates/twerk-core/src/id.rs
+++ replace <impl From<String> for TriggerId>::from -> Self with Default::default()
@@ -176,17 +176,17 @@
     #[must_use]
     pub fn as_str(&self) -> &str {
         &self.0
     }
 }
 
 impl From<String> for TriggerId {
     fn from(s: String) -> Self {
-        Self(s)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl From<&str> for TriggerId {
     fn from(s: &str) -> Self {
         Self(s.to_string())
     }
 }

---- id::tests::trigger_id_from_string_bypasses_validation stdout ----

thread 'id::tests::trigger_id_from_string_bypasses_validation' (951318) panicked at crates/twerk-core/src/id.rs:783:9:
assertion `left == right` failed
  left: ""
 right: "x"

failures:
    id::tests::trigger_id_from_string_bypasses_validation

test result: FAILED. 234 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.54s

*** result: Failure(101)
