*** crates/twerk-core/src/id.rs:190:9: replace <impl From<&str> for TriggerId>::from -> Self with Default::default()

*** mutation diff:
--- crates/twerk-core/src/id.rs
+++ replace <impl From<&str> for TriggerId>::from -> Self with Default::default()
@@ -182,17 +182,17 @@
 impl From<String> for TriggerId {
     fn from(s: String) -> Self {
         Self(s)
     }
 }
 
 impl From<&str> for TriggerId {
     fn from(s: &str) -> Self {
-        Self(s.to_string())
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for TriggerId {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         write!(f, "{}", self.0)
     }
 }

---- id::tests::trigger_id_from_str_bypasses_validation stdout ----

thread 'id::tests::trigger_id_from_str_bypasses_validation' (958625) panicked at crates/twerk-core/src/id.rs:790:9:
assertion `left == right` failed
  left: ""
 right: "y"

failures:
    id::tests::trigger_id_from_str_bypasses_validation

test result: FAILED. 234 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.64s

*** result: Failure(101)
