*** crates/twerk-core/src/trigger.rs:48:13: delete match arm "ACTIVE" in <impl FromStr for TriggerState>::from_str

*** mutation diff:
--- crates/twerk-core/src/trigger.rs
+++ delete match arm "ACTIVE" in <impl FromStr for TriggerState>::from_str
@@ -40,17 +40,17 @@
     }
 }
 
 impl FromStr for TriggerState {
     type Err = ParseTriggerStateError;
 
     fn from_str(s: &str) -> Result<Self, Self::Err> {
         match s.to_uppercase().as_str() {
-            "ACTIVE" => Ok(Self::Active),
+             /* ~ changed by cargo-mutants ~ */
             "PAUSED" => Ok(Self::Paused),
             "DISABLED" => Ok(Self::Disabled),
             "ERROR" => Ok(Self::Error),
             _ => Err(ParseTriggerStateError(s.to_string())),
         }
     }
 }

---- trigger::tests::proptest_trigger_state_from_str_ignores_case stdout ----

thread 'trigger::tests::proptest_trigger_state_from_str_ignores_case' (983309) panicked at crates/twerk-core/src/trigger.rs:387:54:
called `Result::unwrap()` on an `Err` value: ParseTriggerStateError("aCtIvE")

thread 'trigger::tests::proptest_trigger_state_from_str_ignores_case' (983309) panicked at crates/twerk-core/src/trigger.rs:387:54:
called `Result::unwrap()` on an `Err` value: ParseTriggerStateError("ACTIVE")

thread 'trigger::tests::proptest_trigger_state_from_str_ignores_case' (983309) panicked at crates/twerk-core/src/trigger.rs:387:54:
called `Result::unwrap()` on an `Err` value: ParseTriggerStateError("active")
proptest: Saving this and future failures in /tmp/cargo-mutants-twerk-p4m-NnZhMn.tmp/crates/twerk-core/proptest-regressions/trigger.txt
proptest: If this test was run on a CI system, you ma

---- trigger::tests::trigger_state_parses_lowercase_active stdout ----

thread 'trigger::tests::trigger_state_parses_lowercase_active' (983380) panicked at crates/twerk-core/src/trigger.rs:135:46:
called `Result::unwrap()` on an `Err` value: ParseTriggerStateError("active")

---- trigger::tests::trigger_state_parses_uppercase_active stdout ----

thread 'trigger::tests::trigger_state_parses_uppercase_active' (983383) panicked at crates/twerk-core/src/trigger.rs:143:46:
called `Result::unwrap()` on an `Err` value: ParseTriggerStateError("ACTIVE")

failures:
    trigger::tests::proptest_trigger_state_from_str_ignores_case
    trigger::tests::trigger_state_parses_lowercase_active
    trigger::tests::trigger_state_parses_uppercase_active

test result: FAILED. 232 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.54s

*** result: Failure(101)
