*** crates/twerk-core/src/trigger.rs:49:13: delete match arm "PAUSED" in <impl FromStr for TriggerState>::from_str

*** mutation diff:
--- crates/twerk-core/src/trigger.rs
+++ delete match arm "PAUSED" in <impl FromStr for TriggerState>::from_str
@@ -41,17 +41,17 @@
 }
 
 impl FromStr for TriggerState {
     type Err = ParseTriggerStateError;
 
     fn from_str(s: &str) -> Result<Self, Self::Err> {
         match s.to_uppercase().as_str() {
             "ACTIVE" => Ok(Self::Active),
-            "PAUSED" => Ok(Self::Paused),
+             /* ~ changed by cargo-mutants ~ */
             "DISABLED" => Ok(Self::Disabled),
             "ERROR" => Ok(Self::Error),
             _ => Err(ParseTriggerStateError(s.to_string())),
         }
     }
 }
 
 // =========================================================================

---- trigger::tests::trigger_state_parses_mixed_case_paused stdout ----

thread 'trigger::tests::trigger_state_parses_mixed_case_paused' (983498) panicked at crates/twerk-core/src/trigger.rs:151:46:
called `Result::unwrap()` on an `Err` value: ParseTriggerStateError("Paused")

---- trigger::tests::proptest_trigger_state_from_str_ignores_case stdout ----

thread 'trigger::tests::proptest_trigger_state_from_str_ignores_case' (983468) panicked at crates/twerk-core/src/trigger.rs:387:54:
called `Result::unwrap()` on an `Err` value: ParseTriggerStateError("Paused")

thread 'trigger::tests::proptest_trigger_state_from_str_ignores_case' (983468) panicked at crates/twerk-core/src/trigger.rs:387:54:
called `Result::unwrap()` on an `Err` value: ParseTriggerStateError("PAUSED")

thread 'trigger::tests::proptest_trigger_state_from_str_ignores_case' (983468) panicked at crates/twerk-core/src/trigger.rs:387:54:
called `Result::unwrap()` on an `Err` value: ParseTriggerStateError("paused")
proptest: Saving this and future failures in /tmp/cargo-mutants-twerk-p4m-rAVKPt.tmp/crates/twerk-core/proptest-regressions/trigger.txt
proptest: If this test was run on a CI system, you ma

failures:
    trigger::tests::proptest_trigger_state_from_str_ignores_case
    trigger::tests::trigger_state_parses_mixed_case_paused

test result: FAILED. 233 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.44s

*** result: Failure(101)
