*** crates/twerk-core/src/repository_inmemory.rs:47:35: replace > with < in InMemoryRepository::paginate_vec

*** mutation diff:
--- crates/twerk-core/src/repository_inmemory.rs
+++ replace > with < in InMemoryRepository::paginate_vec
@@ -39,17 +39,17 @@
             roles: RwLock::new(HashMap::new()),
             user_roles: RwLock::new(HashMap::new()),
             options,
         }
     }
 
     fn paginate_vec<T: Clone>(items: Vec<T>, page: i64, size: i64) -> Page<T> {
         let total_items = items.len() as i64;
-        let total_pages = if size > 0 {
+        let total_pages = if size < /* ~ changed by cargo-mutants ~ */ 0 {
             (total_items + size - 1) / size
         } else {
             0
         };
         let start = ((page - 1) * size) as usize;
         let end = (start + size as usize).min(items.len());
         let page_items: Vec<T> = if start < items.len() {
             items[start..end].to_vec()

---- repository_inmemory::tests::paginate_jobs stdout ----

thread 'repository_inmemory::tests::paginate_jobs' (864236) panicked at crates/twerk-core/src/repository_inmemory.rs:763:9:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    repository_inmemory::tests::paginate_jobs

test result: FAILED. 608 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.79s

*** result: Failure(101)
