*** crates/twerk-core/src/repository_inmemory.rs:52:33: replace * with + in InMemoryRepository::paginate_vec

*** mutation diff:
--- crates/twerk-core/src/repository_inmemory.rs
+++ replace * with + in InMemoryRepository::paginate_vec
@@ -44,17 +44,17 @@
 
     fn paginate_vec<T: Clone>(items: Vec<T>, page: i64, size: i64) -> Page<T> {
         let total_items = items.len() as i64;
         let total_pages = if size > 0 {
             (total_items + size - 1) / size
         } else {
             0
         };
-        let start = ((page - 1) * size) as usize;
+        let start = ((page - 1) + /* ~ changed by cargo-mutants ~ */ size) as usize;
         let end = (start + size as usize).min(items.len());
         let page_items: Vec<T> = if start < items.len() {
             items[start..end].to_vec()
         } else {
             Vec::new()
         };
         Page {
             items: page_items,

---- repository_inmemory::tests::task_log_parts stdout ----

thread 'repository_inmemory::tests::task_log_parts' (911622) panicked at crates/twerk-core/src/repository_inmemory.rs:747:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    repository_inmemory::tests::task_log_parts

test result: FAILED. 608 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
