*** crates/twerk-core/src/repository_inmemory.rs:101:9: replace <impl Repository for InMemoryRepository>::get_task_by_id -> Result<Task> with Ok(Default::default())

*** mutation diff:
--- crates/twerk-core/src/repository_inmemory.rs
+++ replace <impl Repository for InMemoryRepository>::get_task_by_id -> Result<Task> with Ok(Default::default())
@@ -93,18 +93,17 @@
         let mut tasks = self.tasks.write();
         let task = tasks.get_mut(id).ok_or(Error::TaskNotFound)?;
         let updated = modify(task.clone())?;
         *task = updated;
         Ok(())
     }
 
     async fn get_task_by_id(&self, id: &str) -> Result<Task> {
-        let tasks = self.tasks.read();
-        tasks.get(id).cloned().ok_or(Error::TaskNotFound)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_active_tasks(&self, job_id: &str) -> Result<Vec<Task>> {
         let tasks = self.tasks.read();
         let job_id_str = job_id.to_string();
         Ok(tasks
             .values()
             .filter(|t| {

---- repository_inmemory::tests::get_task_not_found stdout ----

thread 'repository_inmemory::tests::get_task_not_found' (1021377) panicked at crates/twerk-core/src/repository_inmemory.rs:569:9:
assertion failed: matches!(result, Err(Error::TaskNotFound))

---- repository_inmemory::tests::create_and_get_task stdout ----

thread 'repository_inmemory::tests::create_and_get_task' (1021371) panicked at crates/twerk-core/src/repository_inmemory.rs:562:9:
assertion `left == right` failed
  left: None
 right: Some(TaskId("task-1"))

---- repository_inmemory::tests::update_task stdout ----

thread 'repository_inmemory::tests::update_task' (1021383) panicked at crates/twerk-core/src/repository_inmemory.rs:782:9:
assertion `left == right` failed
  left: Created
 right: Running

failures:
    repository_inmemory::tests::create_and_get_task
    repository_inmemory::tests::get_task_not_found
    repository_inmemory::tests::update_task

test result: FAILED. 606 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.63s

*** result: Failure(101)
