*** crates/twerk-core/src/repository_inmemory.rs:106:9: replace <impl Repository for InMemoryRepository>::get_active_tasks -> Result<Vec<Task>> with Ok(vec![Default::default()])

*** mutation diff:
--- crates/twerk-core/src/repository_inmemory.rs
+++ replace <impl Repository for InMemoryRepository>::get_active_tasks -> Result<Vec<Task>> with Ok(vec![Default::default()])
@@ -98,29 +98,17 @@
     }
 
     async fn get_task_by_id(&self, id: &str) -> Result<Task> {
         let tasks = self.tasks.read();
         tasks.get(id).cloned().ok_or(Error::TaskNotFound)
     }
 
     async fn get_active_tasks(&self, job_id: &str) -> Result<Vec<Task>> {
-        let tasks = self.tasks.read();
-        let job_id_str = job_id.to_string();
-        Ok(tasks
-            .values()
-            .filter(|t| {
-                t.job_id
-                    .as_ref()
-                    .map(|j| j.as_str() == job_id_str)
-                    .unwrap_or(false)
-                    && t.state.is_active()
-            })
-            .cloned()
-            .collect())
+        Ok(vec![Default::default()]) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_all_tasks_for_job(&self, job_id: &str) -> Result<Vec<Task>> {
         let tasks = self.tasks.read();
         let job_id_str = job_id.to_string();
         Ok(tasks
             .values()
             .filter(|t| {

---- repository_inmemory::tests::get_active_tasks stdout ----

thread 'repository_inmemory::tests::get_active_tasks' (1034342) panicked at crates/twerk-core/src/repository_inmemory.rs:589:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    repository_inmemory::tests::get_active_tasks

test result: FAILED. 608 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.61s

*** result: Failure(101)
