*** crates/twerk-core/src/repository_inmemory.rs:115:21: replace && with || in <impl Repository for InMemoryRepository>::get_active_tasks

*** mutation diff:
--- crates/twerk-core/src/repository_inmemory.rs
+++ replace && with || in <impl Repository for InMemoryRepository>::get_active_tasks
@@ -107,17 +107,17 @@
         let job_id_str = job_id.to_string();
         Ok(tasks
             .values()
             .filter(|t| {
                 t.job_id
                     .as_ref()
                     .map(|j| j.as_str() == job_id_str)
                     .unwrap_or(false)
-                    && t.state.is_active()
+                    || /* ~ changed by cargo-mutants ~ */ t.state.is_active()
             })
             .cloned()
             .collect())
     }
 
     async fn get_all_tasks_for_job(&self, job_id: &str) -> Result<Vec<Task>> {
         let tasks = self.tasks.read();
         let job_id_str = job_id.to_string();

---- repository_inmemory::tests::get_active_tasks stdout ----

thread 'repository_inmemory::tests::get_active_tasks' (1043159) panicked at crates/twerk-core/src/repository_inmemory.rs:601:9:
assertion `left == right` failed
  left: 3
 right: 2

failures:
    repository_inmemory::tests::get_active_tasks

test result: FAILED. 608 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.62s

*** result: Failure(101)
