*** crates/twerk-core/src/repository_inmemory.rs:122:9: replace <impl Repository for InMemoryRepository>::get_all_tasks_for_job -> Result<Vec<Task>> with Ok(vec![])

*** mutation diff:
--- crates/twerk-core/src/repository_inmemory.rs
+++ replace <impl Repository for InMemoryRepository>::get_all_tasks_for_job -> Result<Vec<Task>> with Ok(vec![])
@@ -114,28 +114,17 @@
                     .unwrap_or(false)
                     && t.state.is_active()
             })
             .cloned()
             .collect())
     }
 
     async fn get_all_tasks_for_job(&self, job_id: &str) -> Result<Vec<Task>> {
-        let tasks = self.tasks.read();
-        let job_id_str = job_id.to_string();
-        Ok(tasks
-            .values()
-            .filter(|t| {
-                t.job_id
-                    .as_ref()
-                    .map(|j| j.as_str() == job_id_str)
-                    .unwrap_or(false)
-            })
-            .cloned()
-            .collect())
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_next_task(&self, parent_task_id: &str) -> Result<Task> {
         let tasks = self.tasks.read();
         let parent = tasks.get(parent_task_id).ok_or(Error::TaskNotFound)?;
         let job_id_str = parent
             .job_id
             .as_ref()

---- rq2_serde_ts_pascal_case_accepted stdout ----

thread 'rq2_serde_ts_pascal_case_accepted' (1059586) panicked at crates/twerk-core/tests/red_queen_gen2.rs:352:9:
serde must accept PascalCase "Active"

---- rq2_ts_serde_case_variants_rejected stdout ----

thread 'rq2_ts_serde_case_variants_rejected' (1059610) panicked at crates/twerk-core/tests/red_queen_gen2.rs:75:9:
serde must accept "Active"

failures:
    rq2_serde_ts_pascal_case_accepted
    rq2_ts_serde_case_variants_rejected

test result: FAILED. 65 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
