*** crates/twerk-core/src/repository_inmemory.rs:137:9: replace <impl Repository for InMemoryRepository>::get_next_task -> Result<Task> with Ok(Default::default())

*** mutation diff:
--- crates/twerk-core/src/repository_inmemory.rs
+++ replace <impl Repository for InMemoryRepository>::get_next_task -> Result<Task> with Ok(Default::default())
@@ -129,40 +129,17 @@
                     .map(|j| j.as_str() == job_id_str)
                     .unwrap_or(false)
             })
             .cloned()
             .collect())
     }
 
     async fn get_next_task(&self, parent_task_id: &str) -> Result<Task> {
-        let tasks = self.tasks.read();
-        let parent = tasks.get(parent_task_id).ok_or(Error::TaskNotFound)?;
-        let job_id_str = parent
-            .job_id
-            .as_ref()
-            .map(|j| j.as_str().to_string())
-            .unwrap_or_default();
-        let parent_position = parent.position;
-        Ok(tasks
-            .values()
-            .filter(|t| {
-                t.job_id
-                    .as_ref()
-                    .map(|j| j.as_str() == job_id_str)
-                    .unwrap_or(false)
-                    && t.parent_id
-                        .as_ref()
-                        .map(|p| p.as_str() == parent_task_id)
-                        .unwrap_or(false)
-                    && t.position > parent_position
-            })
-            .min_by_key(|t| t.position)
-            .cloned()
-            .ok_or(Error::TaskNotFound)?)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn create_task_log_part(&self, part: &TaskLogPart) -> Result<()> {
         let task_id_str = part
             .task_id
             .as_ref()
             .map(|t| t.as_str().to_string())
             .unwrap_or_default();

---- rq2_serde_ts_pascal_case_accepted stdout ----

thread 'rq2_serde_ts_pascal_case_accepted' (1084940) panicked at crates/twerk-core/tests/red_queen_gen2.rs:352:9:
serde must accept PascalCase "Active"

---- rq2_ts_serde_case_variants_rejected stdout ----

thread 'rq2_ts_serde_case_variants_rejected' (1084964) panicked at crates/twerk-core/tests/red_queen_gen2.rs:75:9:
serde must accept "Active"

failures:
    rq2_serde_ts_pascal_case_accepted
    rq2_ts_serde_case_variants_rejected

test result: FAILED. 65 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
