*** crates/twerk-core/src/repository_inmemory.rs:150:41: replace == with != in <impl Repository for InMemoryRepository>::get_next_task

*** mutation diff:
--- crates/twerk-core/src/repository_inmemory.rs
+++ replace == with != in <impl Repository for InMemoryRepository>::get_next_task
@@ -142,17 +142,17 @@
             .map(|j| j.as_str().to_string())
             .unwrap_or_default();
         let parent_position = parent.position;
         Ok(tasks
             .values()
             .filter(|t| {
                 t.job_id
                     .as_ref()
-                    .map(|j| j.as_str() == job_id_str)
+                    .map(|j| j.as_str() != /* ~ changed by cargo-mutants ~ */ job_id_str)
                     .unwrap_or(false)
                     && t.parent_id
                         .as_ref()
                         .map(|p| p.as_str() == parent_task_id)
                         .unwrap_or(false)
                     && t.position > parent_position
             })
             .min_by_key(|t| t.position)

---- rq2_serde_ts_pascal_case_accepted stdout ----

thread 'rq2_serde_ts_pascal_case_accepted' (1108088) panicked at crates/twerk-core/tests/red_queen_gen2.rs:352:9:
serde must accept PascalCase "Active"

---- rq2_ts_serde_case_variants_rejected stdout ----

thread 'rq2_ts_serde_case_variants_rejected' (1108112) panicked at crates/twerk-core/tests/red_queen_gen2.rs:75:9:
serde must accept "Active"

failures:
    rq2_serde_ts_pascal_case_accepted
    rq2_ts_serde_case_variants_rejected

test result: FAILED. 65 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
