*** crates/twerk-core/src/repository_inmemory.rs:164:9: replace <impl Repository for InMemoryRepository>::create_task_log_part -> Result<()> with Ok(())

*** mutation diff:
--- crates/twerk-core/src/repository_inmemory.rs
+++ replace <impl Repository for InMemoryRepository>::create_task_log_part -> Result<()> with Ok(())
@@ -156,27 +156,17 @@
                     && t.position > parent_position
             })
             .min_by_key(|t| t.position)
             .cloned()
             .ok_or(Error::TaskNotFound)?)
     }
 
     async fn create_task_log_part(&self, part: &TaskLogPart) -> Result<()> {
-        let task_id_str = part
-            .task_id
-            .as_ref()
-            .map(|t| t.as_str().to_string())
-            .unwrap_or_default();
-        if task_id_str.is_empty() {
-            return Err(Error::InvalidId("task log part has no task_id".to_string()));
-        }
-        let mut logs = self.task_logs.write();
-        logs.entry(task_id_str).or_default().push(part.clone());
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_task_log_parts(
         &self,
         task_id: &str,
         _q: &str,
         page: i64,
         size: i64,

---- repository_inmemory::tests::task_log_parts stdout ----

thread 'repository_inmemory::tests::task_log_parts' (1146371) panicked at crates/twerk-core/src/repository_inmemory.rs:737:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    repository_inmemory::tests::task_log_parts

test result: FAILED. 608 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
