*** crates/twerk-core/src/repository_inmemory.rs:190:9: replace <impl Repository for InMemoryRepository>::create_node -> Result<()> with Ok(())

*** mutation diff:
--- crates/twerk-core/src/repository_inmemory.rs
+++ replace <impl Repository for InMemoryRepository>::create_node -> Result<()> with Ok(())
@@ -182,30 +182,17 @@
         size: i64,
     ) -> Result<Page<TaskLogPart>> {
         let logs = self.task_logs.read();
         let parts = logs.get(task_id).cloned().unwrap_or_default();
         Ok(Self::paginate_vec(parts, page, size))
     }
 
     async fn create_node(&self, node: &Node) -> Result<()> {
-        let id_str = node
-            .id
-            .as_ref()
-            .map(|id| id.as_str().to_string())
-            .unwrap_or_default();
-        if id_str.is_empty() {
-            return Err(Error::InvalidId("node has no id".to_string()));
-        }
-        let mut nodes = self.nodes.write();
-        if nodes.contains_key(&id_str) {
-            return Err(Error::Database(format!("node {} already exists", id_str)));
-        }
-        nodes.insert(id_str, node.clone());
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn update_node(
         &self,
         id: &str,
         modify: Box<dyn FnOnce(Node) -> Result<Node> + Send>,
     ) -> Result<()> {
         let mut nodes = self.nodes.write();

---- repository_inmemory::tests::get_active_nodes stdout ----

thread 'repository_inmemory::tests::get_active_nodes' (1153975) panicked at crates/twerk-core/src/repository_inmemory.rs:623:9:
assertion `left == right` failed
  left: 0
 right: 2

---- repository_inmemory::tests::create_and_get_node stdout ----

thread 'repository_inmemory::tests::create_and_get_node' (1153969) panicked at crates/twerk-core/src/repository_inmemory.rs:596:61:
called `Result::unwrap()` on an `Err` value: NodeNotFound

---- repository_inmemory::tests::update_node stdout ----

thread 'repository_inmemory::tests::update_node' (1153982) panicked at crates/twerk-core/src/repository_inmemory.rs:787:10:
called `Result::unwrap()` on an `Err` value: NodeNotFound

failures:
    repository_inmemory::tests::create_and_get_node
    repository_inmemory::tests::get_active_nodes
    repository_inmemory::tests::update_node

test result: FAILED. 606 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.64s

*** result: Failure(101)
