*** crates/twerk-core/src/repository_inmemory.rs:211:9: replace <impl Repository for InMemoryRepository>::update_node -> Result<()> with Ok(())

*** mutation diff:
--- crates/twerk-core/src/repository_inmemory.rs
+++ replace <impl Repository for InMemoryRepository>::update_node -> Result<()> with Ok(())
@@ -203,21 +203,17 @@
         Ok(())
     }
 
     async fn update_node(
         &self,
         id: &str,
         modify: Box<dyn FnOnce(Node) -> Result<Node> + Send>,
     ) -> Result<()> {
-        let mut nodes = self.nodes.write();
-        let node = nodes.get_mut(id).ok_or(Error::NodeNotFound)?;
-        let updated = modify(node.clone())?;
-        *node = updated;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_node_by_id(&self, id: &str) -> Result<Node> {
         let nodes = self.nodes.read();
         nodes.get(id).cloned().ok_or(Error::NodeNotFound)
     }
 
     async fn get_active_nodes(&self) -> Result<Vec<Node>> {

---- repository_inmemory::tests::update_node stdout ----

thread 'repository_inmemory::tests::update_node' (1159735) panicked at crates/twerk-core/src/repository_inmemory.rs:799:9:
assertion `left == right` failed
  left: Some(UP)
 right: Some(DOWN)

failures:
    repository_inmemory::tests::update_node

test result: FAILED. 608 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.62s

*** result: Failure(101)
