*** crates/twerk-core/src/repository_inmemory.rs:219:9: replace <impl Repository for InMemoryRepository>::get_node_by_id -> Result<Node> with Ok(Default::default())

*** mutation diff:
--- crates/twerk-core/src/repository_inmemory.rs
+++ replace <impl Repository for InMemoryRepository>::get_node_by_id -> Result<Node> with Ok(Default::default())
@@ -211,18 +211,17 @@
         let mut nodes = self.nodes.write();
         let node = nodes.get_mut(id).ok_or(Error::NodeNotFound)?;
         let updated = modify(node.clone())?;
         *node = updated;
         Ok(())
     }
 
     async fn get_node_by_id(&self, id: &str) -> Result<Node> {
-        let nodes = self.nodes.read();
-        nodes.get(id).cloned().ok_or(Error::NodeNotFound)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_active_nodes(&self) -> Result<Vec<Node>> {
         let nodes = self.nodes.read();
         Ok(nodes
             .values()
             .filter(|n| {
                 n.status

---- repository_inmemory::tests::create_and_get_node stdout ----

thread 'repository_inmemory::tests::create_and_get_node' (1166214) panicked at crates/twerk-core/src/repository_inmemory.rs:609:9:
assertion `left == right` failed
  left: None
 right: Some(NodeId("node-1"))

---- repository_inmemory::tests::update_node stdout ----

thread 'repository_inmemory::tests::update_node' (1166227) panicked at crates/twerk-core/src/repository_inmemory.rs:802:9:
assertion `left == right` failed
  left: None
 right: Some(DOWN)

failures:
    repository_inmemory::tests::create_and_get_node
    repository_inmemory::tests::update_node

test result: FAILED. 607 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.64s

*** result: Failure(101)
