*** crates/twerk-core/src/repository_inmemory.rs:224:9: replace <impl Repository for InMemoryRepository>::get_active_nodes -> Result<Vec<Node>> with Ok(vec![])

*** mutation diff:
--- crates/twerk-core/src/repository_inmemory.rs
+++ replace <impl Repository for InMemoryRepository>::get_active_nodes -> Result<Vec<Node>> with Ok(vec![])
@@ -216,27 +216,17 @@
     }
 
     async fn get_node_by_id(&self, id: &str) -> Result<Node> {
         let nodes = self.nodes.read();
         nodes.get(id).cloned().ok_or(Error::NodeNotFound)
     }
 
     async fn get_active_nodes(&self) -> Result<Vec<Node>> {
-        let nodes = self.nodes.read();
-        Ok(nodes
-            .values()
-            .filter(|n| {
-                n.status
-                    .as_ref()
-                    .map(|s| s.as_ref() == "UP")
-                    .unwrap_or(false)
-            })
-            .cloned()
-            .collect())
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn create_job(&self, job: &Job) -> Result<()> {
         let id_str = job
             .id
             .as_ref()
             .map(|id| id.as_str().to_string())
             .unwrap_or_default();

---- repository_inmemory::tests::get_active_nodes stdout ----

thread 'repository_inmemory::tests::get_active_nodes' (1174221) panicked at crates/twerk-core/src/repository_inmemory.rs:626:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    repository_inmemory::tests::get_active_nodes

test result: FAILED. 608 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.61s

*** result: Failure(101)
