*** crates/twerk-core/src/repository_inmemory.rs:230:41: replace == with != in <impl Repository for InMemoryRepository>::get_active_nodes

*** mutation diff:
--- crates/twerk-core/src/repository_inmemory.rs
+++ replace == with != in <impl Repository for InMemoryRepository>::get_active_nodes
@@ -222,17 +222,17 @@
 
     async fn get_active_nodes(&self) -> Result<Vec<Node>> {
         let nodes = self.nodes.read();
         Ok(nodes
             .values()
             .filter(|n| {
                 n.status
                     .as_ref()
-                    .map(|s| s.as_ref() == "UP")
+                    .map(|s| s.as_ref() != /* ~ changed by cargo-mutants ~ */ "UP")
                     .unwrap_or(false)
             })
             .cloned()
             .collect())
     }
 
     async fn create_job(&self, job: &Job) -> Result<()> {
         let id_str = job

---- repository_inmemory::tests::get_active_nodes stdout ----

thread 'repository_inmemory::tests::get_active_nodes' (1191121) panicked at crates/twerk-core/src/repository_inmemory.rs:636:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    repository_inmemory::tests::get_active_nodes

test result: FAILED. 608 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
