*** crates/twerk-core/src/repository_inmemory.rs:238:9: replace <impl Repository for InMemoryRepository>::create_job -> Result<()> with Ok(())

*** mutation diff:
--- crates/twerk-core/src/repository_inmemory.rs
+++ replace <impl Repository for InMemoryRepository>::create_job -> Result<()> with Ok(())
@@ -230,30 +230,17 @@
                     .map(|s| s.as_ref() == "UP")
                     .unwrap_or(false)
             })
             .cloned()
             .collect())
     }
 
     async fn create_job(&self, job: &Job) -> Result<()> {
-        let id_str = job
-            .id
-            .as_ref()
-            .map(|id| id.as_str().to_string())
-            .unwrap_or_default();
-        if id_str.is_empty() {
-            return Err(Error::InvalidId("job has no id".to_string()));
-        }
-        let mut jobs = self.jobs.write();
-        if jobs.contains_key(&id_str) {
-            return Err(Error::Database(format!("job {} already exists", id_str)));
-        }
-        jobs.insert(id_str, job.clone());
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn update_job(
         &self,
         id: &str,
         modify: Box<dyn FnOnce(Job) -> Result<Job> + Send>,
     ) -> Result<()> {
         let mut jobs = self.jobs.write();

---- repository_inmemory::tests::create_and_get_job stdout ----

thread 'repository_inmemory::tests::create_and_get_job' (1199202) panicked at crates/twerk-core/src/repository_inmemory.rs:634:14:
called `Result::unwrap()` on an `Err` value: JobNotFound

---- repository_inmemory::tests::paginate_jobs stdout ----

thread 'repository_inmemory::tests::paginate_jobs' (1199223) panicked at crates/twerk-core/src/repository_inmemory.rs:748:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    repository_inmemory::tests::create_and_get_job
    repository_inmemory::tests::paginate_jobs

test result: FAILED. 607 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.61s

*** result: Failure(101)
