*** crates/twerk-core/src/repository_inmemory.rs:259:9: replace <impl Repository for InMemoryRepository>::update_job -> Result<()> with Ok(())

*** mutation diff:
--- crates/twerk-core/src/repository_inmemory.rs
+++ replace <impl Repository for InMemoryRepository>::update_job -> Result<()> with Ok(())
@@ -251,21 +251,17 @@
         Ok(())
     }
 
     async fn update_job(
         &self,
         id: &str,
         modify: Box<dyn FnOnce(Job) -> Result<Job> + Send>,
     ) -> Result<()> {
-        let mut jobs = self.jobs.write();
-        let job = jobs.get_mut(id).ok_or(Error::JobNotFound)?;
-        let updated = modify(job.clone())?;
-        *job = updated;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_job_by_id(&self, id: &str) -> Result<Job> {
         let jobs = self.jobs.read();
         jobs.get(id).cloned().ok_or(Error::JobNotFound)
     }
 
     async fn get_job_log_parts(

---- rq2_serde_ts_pascal_case_accepted stdout ----

thread 'rq2_serde_ts_pascal_case_accepted' (1208736) panicked at crates/twerk-core/tests/red_queen_gen2.rs:352:9:
serde must accept PascalCase "Active"

---- rq2_ts_serde_case_variants_rejected stdout ----

thread 'rq2_ts_serde_case_variants_rejected' (1208761) panicked at crates/twerk-core/tests/red_queen_gen2.rs:75:9:
serde must accept "Active"

failures:
    rq2_serde_ts_pascal_case_accepted
    rq2_ts_serde_case_variants_rejected

test result: FAILED. 65 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
