*** crates/twerk-core/src/repository_inmemory.rs:267:9: replace <impl Repository for InMemoryRepository>::get_job_by_id -> Result<Job> with Ok(Default::default())

*** mutation diff:
--- crates/twerk-core/src/repository_inmemory.rs
+++ replace <impl Repository for InMemoryRepository>::get_job_by_id -> Result<Job> with Ok(Default::default())
@@ -259,18 +259,17 @@
         let mut jobs = self.jobs.write();
         let job = jobs.get_mut(id).ok_or(Error::JobNotFound)?;
         let updated = modify(job.clone())?;
         *job = updated;
         Ok(())
     }
 
     async fn get_job_by_id(&self, id: &str) -> Result<Job> {
-        let jobs = self.jobs.read();
-        jobs.get(id).cloned().ok_or(Error::JobNotFound)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_job_log_parts(
         &self,
         job_id: &str,
         _q: &str,
         page: i64,
         size: i64,

---- repository_inmemory::tests::create_and_get_job stdout ----

thread 'repository_inmemory::tests::create_and_get_job' (1214619) panicked at crates/twerk-core/src/repository_inmemory.rs:647:9:
assertion `left == right` failed
  left: None
 right: Some(JobId("550e8400-e29b-41d4-a716-446655440000"))

failures:
    repository_inmemory::tests::create_and_get_job

test result: FAILED. 608 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.92s

*** result: Failure(101)
