*** crates/twerk-core/src/repository_inmemory.rs:296:9: replace <impl Repository for InMemoryRepository>::create_scheduled_job -> Result<()> with Ok(())

*** mutation diff:
--- crates/twerk-core/src/repository_inmemory.rs
+++ replace <impl Repository for InMemoryRepository>::create_scheduled_job -> Result<()> with Ok(())
@@ -288,33 +288,17 @@
         size: i64,
     ) -> Result<Page<JobSummary>> {
         let jobs = self.jobs.read();
         let summaries: Vec<JobSummary> = jobs.values().map(crate::job::new_job_summary).collect();
         Ok(Self::paginate_vec(summaries, page, size))
     }
 
     async fn create_scheduled_job(&self, sj: &ScheduledJob) -> Result<()> {
-        let id_str = sj
-            .id
-            .as_ref()
-            .map(|id| id.as_str().to_string())
-            .unwrap_or_default();
-        if id_str.is_empty() {
-            return Err(Error::InvalidId("scheduled job has no id".to_string()));
-        }
-        let mut sjs = self.scheduled_jobs.write();
-        if sjs.contains_key(&id_str) {
-            return Err(Error::Database(format!(
-                "scheduled job {} already exists",
-                id_str
-            )));
-        }
-        sjs.insert(id_str, sj.clone());
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_active_scheduled_jobs(&self) -> Result<Vec<ScheduledJob>> {
         let sjs = self.scheduled_jobs.read();
         Ok(sjs
             .values()
             .filter(|sj| sj.state == crate::job::ScheduledJobState::Active)
             .cloned()

---- repository_inmemory::tests::create_and_get_scheduled_job stdout ----

thread 'repository_inmemory::tests::create_and_get_scheduled_job' (1224866) panicked at crates/twerk-core/src/repository_inmemory.rs:644:68:
called `Result::unwrap()` on an `Err` value: ScheduledJobNotFound

---- repository_inmemory::tests::delete_scheduled_job stdout ----

thread 'repository_inmemory::tests::delete_scheduled_job' (1224872) panicked at crates/twerk-core/src/repository_inmemory.rs:657:49:
called `Result::unwrap()` on an `Err` value: ScheduledJobNotFound

---- repository_inmemory::tests::update_scheduled_job stdout ----

thread 'repository_inmemory::tests::update_scheduled_job' (1224884) panicked at crates/twerk-core/src/repository_inmemory.rs:808:10:
called `Result::unwrap()` on an `Err` value: ScheduledJobNotFound

failures:
    repository_inmemory::tests::create_and_get_scheduled_job
    repository_inmemory::tests::delete_scheduled_job
    repository_inmemory::tests::update_scheduled_job

test result: FAILED. 606 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.93s

*** result: Failure(101)
