*** crates/twerk-core/src/repository_inmemory.rs:316:9: replace <impl Repository for InMemoryRepository>::get_active_scheduled_jobs -> Result<Vec<ScheduledJob>> with Ok(vec![Default::default()])

*** mutation diff:
--- crates/twerk-core/src/repository_inmemory.rs
+++ replace <impl Repository for InMemoryRepository>::get_active_scheduled_jobs -> Result<Vec<ScheduledJob>> with Ok(vec![Default::default()])
@@ -308,22 +308,17 @@
                 id_str
             )));
         }
         sjs.insert(id_str, sj.clone());
         Ok(())
     }
 
     async fn get_active_scheduled_jobs(&self) -> Result<Vec<ScheduledJob>> {
-        let sjs = self.scheduled_jobs.read();
-        Ok(sjs
-            .values()
-            .filter(|sj| sj.state == crate::job::ScheduledJobState::Active)
-            .cloned()
-            .collect())
+        Ok(vec![Default::default()]) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_scheduled_jobs(
         &self,
         _current_user: &str,
         page: i64,
         size: i64,
     ) -> Result<Page<ScheduledJobSummary>> {

---- rq2_serde_ts_pascal_case_accepted stdout ----

thread 'rq2_serde_ts_pascal_case_accepted' (1244140) panicked at crates/twerk-core/tests/red_queen_gen2.rs:352:9:
serde must accept PascalCase "Active"

---- rq2_ts_serde_case_variants_rejected stdout ----

thread 'rq2_ts_serde_case_variants_rejected' (1244165) panicked at crates/twerk-core/tests/red_queen_gen2.rs:75:9:
serde must accept "Active"

failures:
    rq2_serde_ts_pascal_case_accepted
    rq2_ts_serde_case_variants_rejected

test result: FAILED. 65 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
