*** crates/twerk-core/src/repository_inmemory.rs:339:9: replace <impl Repository for InMemoryRepository>::get_scheduled_job_by_id -> Result<ScheduledJob> with Ok(Default::default())

*** mutation diff:
--- crates/twerk-core/src/repository_inmemory.rs
+++ replace <impl Repository for InMemoryRepository>::get_scheduled_job_by_id -> Result<ScheduledJob> with Ok(Default::default())
@@ -331,18 +331,17 @@
         let summaries: Vec<ScheduledJobSummary> = sjs
             .values()
             .map(crate::job::new_scheduled_job_summary)
             .collect();
         Ok(Self::paginate_vec(summaries, page, size))
     }
 
     async fn get_scheduled_job_by_id(&self, id: &str) -> Result<ScheduledJob> {
-        let sjs = self.scheduled_jobs.read();
-        sjs.get(id).cloned().ok_or(Error::ScheduledJobNotFound)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn update_scheduled_job(
         &self,
         id: &str,
         modify: Box<dyn FnOnce(ScheduledJob) -> Result<ScheduledJob> + Send>,
     ) -> Result<()> {
         let mut sjs = self.scheduled_jobs.write();

---- repository_inmemory::tests::update_scheduled_job stdout ----

thread 'repository_inmemory::tests::update_scheduled_job' (1263814) panicked at crates/twerk-core/src/repository_inmemory.rs:826:9:
assertion `left == right` failed
  left: Active
 right: Paused

---- repository_inmemory::tests::delete_scheduled_job stdout ----

thread 'repository_inmemory::tests::delete_scheduled_job' (1263805) panicked at crates/twerk-core/src/repository_inmemory.rs:674:9:
assertion failed: matches!(result, Err(Error::ScheduledJobNotFound))

---- repository_inmemory::tests::create_and_get_scheduled_job stdout ----

thread 'repository_inmemory::tests::create_and_get_scheduled_job' (1263802) panicked at crates/twerk-core/src/repository_inmemory.rs:660:9:
assertion `left == right` failed
  left: None
 right: Some(ScheduledJobId("sj-1"))

failures:
    repository_inmemory::tests::create_and_get_scheduled_job
    repository_inmemory::tests::delete_scheduled_job
    repository_inmemory::tests::update_scheduled_job

test result: FAILED. 606 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.80s

*** result: Failure(101)
