*** crates/twerk-core/src/repository_inmemory.rs:348:9: replace <impl Repository for InMemoryRepository>::update_scheduled_job -> Result<()> with Ok(())

*** mutation diff:
--- crates/twerk-core/src/repository_inmemory.rs
+++ replace <impl Repository for InMemoryRepository>::update_scheduled_job -> Result<()> with Ok(())
@@ -340,21 +340,17 @@
         sjs.get(id).cloned().ok_or(Error::ScheduledJobNotFound)
     }
 
     async fn update_scheduled_job(
         &self,
         id: &str,
         modify: Box<dyn FnOnce(ScheduledJob) -> Result<ScheduledJob> + Send>,
     ) -> Result<()> {
-        let mut sjs = self.scheduled_jobs.write();
-        let sj = sjs.get_mut(id).ok_or(Error::ScheduledJobNotFound)?;
-        let updated = modify(sj.clone())?;
-        *sj = updated;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn delete_scheduled_job(&self, id: &str) -> Result<()> {
         let mut sjs = self.scheduled_jobs.write();
         sjs.remove(id).ok_or(Error::ScheduledJobNotFound)?;
         Ok(())
     }

---- repository_inmemory::tests::update_scheduled_job stdout ----

thread 'repository_inmemory::tests::update_scheduled_job' (1269593) panicked at crates/twerk-core/src/repository_inmemory.rs:823:9:
assertion `left == right` failed
  left: Active
 right: Paused

failures:
    repository_inmemory::tests::update_scheduled_job

test result: FAILED. 608 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
