*** crates/twerk-core/src/repository_inmemory.rs:356:9: replace <impl Repository for InMemoryRepository>::delete_scheduled_job -> Result<()> with Ok(())

*** mutation diff:
--- crates/twerk-core/src/repository_inmemory.rs
+++ replace <impl Repository for InMemoryRepository>::delete_scheduled_job -> Result<()> with Ok(())
@@ -348,19 +348,17 @@
         let mut sjs = self.scheduled_jobs.write();
         let sj = sjs.get_mut(id).ok_or(Error::ScheduledJobNotFound)?;
         let updated = modify(sj.clone())?;
         *sj = updated;
         Ok(())
     }
 
     async fn delete_scheduled_job(&self, id: &str) -> Result<()> {
-        let mut sjs = self.scheduled_jobs.write();
-        sjs.remove(id).ok_or(Error::ScheduledJobNotFound)?;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn create_user(&self, user: &User) -> Result<()> {
         let id_str = user
             .id
             .as_ref()
             .map(|id| id.as_str().to_string())
             .unwrap_or_default();

---- repository_inmemory::tests::delete_scheduled_job stdout ----

thread 'repository_inmemory::tests::delete_scheduled_job' (1275634) panicked at crates/twerk-core/src/repository_inmemory.rs:673:9:
assertion failed: matches!(result, Err(Error::ScheduledJobNotFound))

failures:
    repository_inmemory::tests::delete_scheduled_job

test result: FAILED. 608 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
