*** crates/twerk-core/src/repository_inmemory.rs:362:9: replace <impl Repository for InMemoryRepository>::create_user -> Result<()> with Ok(())

*** mutation diff:
--- crates/twerk-core/src/repository_inmemory.rs
+++ replace <impl Repository for InMemoryRepository>::create_user -> Result<()> with Ok(())
@@ -354,30 +354,17 @@
 
     async fn delete_scheduled_job(&self, id: &str) -> Result<()> {
         let mut sjs = self.scheduled_jobs.write();
         sjs.remove(id).ok_or(Error::ScheduledJobNotFound)?;
         Ok(())
     }
 
     async fn create_user(&self, user: &User) -> Result<()> {
-        let id_str = user
-            .id
-            .as_ref()
-            .map(|id| id.as_str().to_string())
-            .unwrap_or_default();
-        if id_str.is_empty() {
-            return Err(Error::InvalidId("user has no id".to_string()));
-        }
-        let mut users = self.users.write();
-        if users.contains_key(&id_str) {
-            return Err(Error::Database(format!("user {} already exists", id_str)));
-        }
-        users.insert(id_str, user.clone());
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_user(&self, username: &str) -> Result<User> {
         let users = self.users.read();
         users
             .values()
             .find(|u| u.username.as_deref() == Some(username))
             .cloned()

---- repository_inmemory::tests::create_and_get_user stdout ----

thread 'repository_inmemory::tests::create_and_get_user' (1281837) panicked at crates/twerk-core/src/repository_inmemory.rs:670:54:
called `Result::unwrap()` on an `Err` value: UserNotFound

failures:
    repository_inmemory::tests::create_and_get_user

test result: FAILED. 608 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.62s

*** result: Failure(101)
