*** crates/twerk-core/src/repository_inmemory.rs:379:9: replace <impl Repository for InMemoryRepository>::get_user -> Result<User> with Ok(Default::default())

*** mutation diff:
--- crates/twerk-core/src/repository_inmemory.rs
+++ replace <impl Repository for InMemoryRepository>::get_user -> Result<User> with Ok(Default::default())
@@ -371,22 +371,17 @@
         if users.contains_key(&id_str) {
             return Err(Error::Database(format!("user {} already exists", id_str)));
         }
         users.insert(id_str, user.clone());
         Ok(())
     }
 
     async fn get_user(&self, username: &str) -> Result<User> {
-        let users = self.users.read();
-        users
-            .values()
-            .find(|u| u.username.as_deref() == Some(username))
-            .cloned()
-            .ok_or(Error::UserNotFound)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn create_role(&self, role: &Role) -> Result<()> {
         let id_str = role
             .id
             .as_ref()
             .map(|id| id.as_str().to_string())
             .unwrap_or_default();

---- repository_inmemory::tests::create_and_get_user stdout ----

thread 'repository_inmemory::tests::create_and_get_user' (1288352) panicked at crates/twerk-core/src/repository_inmemory.rs:679:9:
assertion `left == right` failed
  left: None
 right: Some("alice")

---- repository_inmemory::tests::user_not_found stdout ----

thread 'repository_inmemory::tests::user_not_found' (1288367) panicked at crates/twerk-core/src/repository_inmemory.rs:686:9:
assertion failed: matches!(result, Err(Error::UserNotFound))

failures:
    repository_inmemory::tests::create_and_get_user
    repository_inmemory::tests::user_not_found

test result: FAILED. 607 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.61s

*** result: Failure(101)
