*** crates/twerk-core/src/repository_inmemory.rs:53:26: replace + with - in InMemoryRepository::paginate_vec

*** mutation diff:
--- crates/twerk-core/src/repository_inmemory.rs
+++ replace + with - in InMemoryRepository::paginate_vec
@@ -45,17 +45,17 @@
     fn paginate_vec<T: Clone>(items: Vec<T>, page: i64, size: i64) -> Page<T> {
         let total_items = items.len() as i64;
         let total_pages = if size > 0 {
             (total_items + size - 1) / size
         } else {
             0
         };
         let start = ((page - 1) * size) as usize;
-        let end = (start + size as usize).min(items.len());
+        let end = (start - /* ~ changed by cargo-mutants ~ */ size as usize).min(items.len());
         let page_items: Vec<T> = if start < items.len() {
             items[start..end].to_vec()
         } else {
             Vec::new()
         };
         Page {
             items: page_items,
             number: page,

---- repository_inmemory::tests::paginate_jobs stdout ----

thread 'repository_inmemory::tests::paginate_jobs' (971553) panicked at crates/twerk-core/src/repository_inmemory.rs:53:19:
attempt to subtract with overflow

---- repository_inmemory::tests::task_log_parts stdout ----

thread 'repository_inmemory::tests::task_log_parts' (971554) panicked at crates/twerk-core/src/repository_inmemory.rs:53:19:
attempt to subtract with overflow

failures:
    repository_inmemory::tests::paginate_jobs
    repository_inmemory::tests::task_log_parts

test result: FAILED. 607 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.61s

*** result: Failure(101)
