*** crates/twerk-core/src/repository_inmemory.rs:54:43: replace < with > in InMemoryRepository::paginate_vec

*** mutation diff:
--- crates/twerk-core/src/repository_inmemory.rs
+++ replace < with > in InMemoryRepository::paginate_vec
@@ -46,17 +46,17 @@
         let total_items = items.len() as i64;
         let total_pages = if size > 0 {
             (total_items + size - 1) / size
         } else {
             0
         };
         let start = ((page - 1) * size) as usize;
         let end = (start + size as usize).min(items.len());
-        let page_items: Vec<T> = if start < items.len() {
+        let page_items: Vec<T> = if start > /* ~ changed by cargo-mutants ~ */ items.len() {
             items[start..end].to_vec()
         } else {
             Vec::new()
         };
         Page {
             items: page_items,
             number: page,
             size,

---- repository_inmemory::tests::paginate_jobs stdout ----

thread 'repository_inmemory::tests::paginate_jobs' (993312) panicked at crates/twerk-core/src/repository_inmemory.rs:761:9:
assertion `left == right` failed
  left: 0
 right: 2

---- repository_inmemory::tests::task_log_parts stdout ----

thread 'repository_inmemory::tests::task_log_parts' (993313) panicked at crates/twerk-core/src/repository_inmemory.rs:747:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    repository_inmemory::tests::paginate_jobs
    repository_inmemory::tests::task_log_parts

test result: FAILED. 607 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
