*** crates/twerk-core/src/repository_inmemory.rs:54:43: replace < with <= in InMemoryRepository::paginate_vec

*** mutation diff:
--- crates/twerk-core/src/repository_inmemory.rs
+++ replace < with <= in InMemoryRepository::paginate_vec
@@ -46,17 +46,17 @@
         let total_items = items.len() as i64;
         let total_pages = if size > 0 {
             (total_items + size - 1) / size
         } else {
             0
         };
         let start = ((page - 1) * size) as usize;
         let end = (start + size as usize).min(items.len());
-        let page_items: Vec<T> = if start < items.len() {
+        let page_items: Vec<T> = if start <= /* ~ changed by cargo-mutants ~ */ items.len() {
             items[start..end].to_vec()
         } else {
             Vec::new()
         };
         Page {
             items: page_items,
             number: page,
             size,

---- rq2_serde_ts_pascal_case_accepted stdout ----

thread 'rq2_serde_ts_pascal_case_accepted' (1002192) panicked at crates/twerk-core/tests/red_queen_gen2.rs:352:9:
serde must accept PascalCase "Active"

---- rq2_ts_serde_case_variants_rejected stdout ----

thread 'rq2_ts_serde_case_variants_rejected' (1002216) panicked at crates/twerk-core/tests/red_queen_gen2.rs:75:9:
serde must accept "Active"

failures:
    rq2_serde_ts_pascal_case_accepted
    rq2_ts_serde_case_variants_rejected

test result: FAILED. 65 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
