*** crates/twerk-core/src/repository_inmemory.rs:72:9: replace <impl Repository for InMemoryRepository>::create_task -> Result<()> with Ok(())

*** mutation diff:
--- crates/twerk-core/src/repository_inmemory.rs
+++ replace <impl Repository for InMemoryRepository>::create_task -> Result<()> with Ok(())
@@ -64,30 +64,17 @@
             total_items,
         }
     }
 }
 
 #[async_trait]
 impl Repository for InMemoryRepository {
     async fn create_task(&self, task: &Task) -> Result<()> {
-        let id_str = task
-            .id
-            .as_ref()
-            .map(|id| id.as_str().to_string())
-            .unwrap_or_default();
-        if id_str.is_empty() {
-            return Err(Error::InvalidId("task has no id".to_string()));
-        }
-        let mut tasks = self.tasks.write();
-        if tasks.contains_key(&id_str) {
-            return Err(Error::Database(format!("task {} already exists", id_str)));
-        }
-        tasks.insert(id_str, task.clone());
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn update_task(
         &self,
         id: &str,
         modify: Box<dyn FnOnce(Task) -> Result<Task> + Send>,
     ) -> Result<()> {
         let mut tasks = self.tasks.write();

---- repository_inmemory::tests::get_active_tasks stdout ----

thread 'repository_inmemory::tests::get_active_tasks' (1008684) panicked at crates/twerk-core/src/repository_inmemory.rs:588:9:
assertion `left == right` failed
  left: 0
 right: 2

---- repository_inmemory::tests::update_task stdout ----

thread 'repository_inmemory::tests::update_task' (1008692) panicked at crates/twerk-core/src/repository_inmemory.rs:767:10:
called `Result::unwrap()` on an `Err` value: TaskNotFound

---- repository_inmemory::tests::create_and_get_task stdout ----

thread 'repository_inmemory::tests::create_and_get_task' (1008677) panicked at crates/twerk-core/src/repository_inmemory.rs:549:61:
called `Result::unwrap()` on an `Err` value: TaskNotFound

failures:
    repository_inmemory::tests::create_and_get_task
    repository_inmemory::tests::get_active_tasks
    repository_inmemory::tests::update_task

test result: FAILED. 606 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.59s

*** result: Failure(101)
