*** crates/twerk-core/src/repository_inmemory.rs:93:9: replace <impl Repository for InMemoryRepository>::update_task -> Result<()> with Ok(())

*** mutation diff:
--- crates/twerk-core/src/repository_inmemory.rs
+++ replace <impl Repository for InMemoryRepository>::update_task -> Result<()> with Ok(())
@@ -85,21 +85,17 @@
         Ok(())
     }
 
     async fn update_task(
         &self,
         id: &str,
         modify: Box<dyn FnOnce(Task) -> Result<Task> + Send>,
     ) -> Result<()> {
-        let mut tasks = self.tasks.write();
-        let task = tasks.get_mut(id).ok_or(Error::TaskNotFound)?;
-        let updated = modify(task.clone())?;
-        *task = updated;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_task_by_id(&self, id: &str) -> Result<Task> {
         let tasks = self.tasks.read();
         tasks.get(id).cloned().ok_or(Error::TaskNotFound)
     }
 
     async fn get_active_tasks(&self, job_id: &str) -> Result<Vec<Task>> {

---- repository_inmemory::tests::update_task stdout ----

thread 'repository_inmemory::tests::update_task' (1015032) panicked at crates/twerk-core/src/repository_inmemory.rs:779:9:
assertion `left == right` failed
  left: Created
 right: Running

failures:
    repository_inmemory::tests::update_task

test result: FAILED. 608 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.59s

*** result: Failure(101)
